[
  {
    "platform": "Booking.com",
    "review_date": "2025-05-12",
    "reviewer_name": "Jo",
    "star_rating": 3.5,
    "review_text": "=== Generally a nice stay with a couple of niggles. ===\nLiked: The staff were very nice, polite and knowledgeable about the building. Room was clean with a comfortable bed.Nice bathroom with lovely toiletries.Restaurant food was outstanding and it was nice to receive a birthday sweet treat ....good communication as I'd only mentioned on the phone  briefly the  week before.\nDisliked: Although if is made very clear that parking is on a first come basis we found it really annoying we had to pay with no reimbursement from the hotel,while there were 2 cars in the carpark with no hotel voucher on show. Seems an unfair system to me that some will pay for parking and some won't.\nOur rooms in the attic area, I suppose, were price point relevant but my brother in the opposite room and myself, who are both reasonably tall spent any time in the room hunched over because of the sloping ceilings. It was really uncomfortable! I had no view onto the high street, there seemed to be white hoardings in the way which were ugly and made me feel quite claustrophobic. I will say that Joseph rang a minute after we got in the room and I did say it was fine but I'd barely had a chance to glance around before he rang. \nFinally, my sister in law put a pair of jeans on a wardrobe shelf and the shelf collapsed. Considering it's a fairly new refurbishment I do think furniture, fixtures and fittings should be to a good standard.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-05-11",
    "reviewer_name": "Tim",
    "star_rating": 5.0,
    "review_text": "Liked: Lovely hotel in a great location.  The staff were friendly and helpful  The garden is gorgeous.  Would definitely stay there again and highly recommend.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-05-10",
    "reviewer_name": "Tracy",
    "star_rating": 2.5,
    "review_text": "=== Style over content ===\nLiked: Gardens\nDisliked: Rooms over furnished and cramped, breakfasts lacked taste and were quite odd, breakfast seating was not comfortable",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-05-10",
    "reviewer_name": "Olga",
    "star_rating": 5.0,
    "review_text": "=== Best choice for a nice break ===\nLiked: Excellent location, amazing room (got upgraded to the suite with lovely view), the staff was so kind and went beyond to make us feel welcomed - looking forward to coming back\nDisliked: None",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-05-05",
    "reviewer_name": "Shirley",
    "star_rating": 4.5,
    "review_text": "=== A pleasant stay in lovely surroundings. ===\nLiked: Very good selection of food and good service at breakfast. \r\nNice surroundings and picturesque walk to the boats.\nDisliked: The traffic noise from early in the morning in our room  spoiled our otherwise peaceful stay.Our room was at the front of the hotel. \r\nCarpet markers on the edge of upstairs steps could be useful. Had to walk very carefully, so as not to trip.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-05-04",
    "reviewer_name": "Nick",
    "star_rating": 4.0,
    "review_text": "Disliked: Room was too small",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-30",
    "reviewer_name": "Liz",
    "star_rating": 5.0,
    "review_text": "=== A beautiful hotel ===\nLiked: The hotel is lovely, the decor throughout is beautiful and the staff were all very friendly and welcoming. We were upgraded to a terrace room which was very nice and opened out into the garden which is very pleasant to sit out and have a drink in. The location is great, right on the high street.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-27",
    "reviewer_name": "Emma",
    "star_rating": 4.5,
    "review_text": "=== The most welcoming getaway - will definitely be back. ===\nLiked: Everything was wonderful and the staff nd little touches were exceptional - real milk delivered to your room every morning was so nice.\nDisliked: I had a room on the high street side at the weekend and it was noisy through the night (above the hotel bar and backing onto a relatively busy high street where at 2am on Sunday morning it sounded like some people were having a car drag race). But it wouldn’t stop me from coming back again, but I would just ask for/ book a room on the other side of the property where my friend was staying and didn’t hear a thing.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-20",
    "reviewer_name": "Kathryn",
    "star_rating": 5.0,
    "review_text": "=== Feel very at home here and the staff are all friendly and welcoming! ===\nLiked: Warm and friendly atmosphere!",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-18",
    "reviewer_name": "Maria",
    "star_rating": 5.0,
    "review_text": "=== Great staff, clean, beautiful breakfast ===\nLiked: Nice and well looked after building with an atmosphere. Very polite and nice staff.\nBreakfast is 10/10 - were initially planning on skipping it; but after trying first morning got addicted.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-16",
    "reviewer_name": "Jeff",
    "star_rating": 4.5,
    "review_text": "=== Brilliant ===\nLiked: Great location. Not sure about the daily milk delivery to the room. Really polite, friendly and efficient staff.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-15",
    "reviewer_name": "World",
    "star_rating": 5.0,
    "review_text": "=== Everything was wonderful; we will come back again, and would highly recommend it! ===\nLiked: The staff were all very friendly, professional, and helpful. We had dinner in the restaurant and everything was great. The bed and comforter and pillows are super comfortable and it was the best night's sleep we got in over a week. The shower was great, the toiletries and towels were great. It was all wonderful. The location is convenient for walking to the Quay, shops, restaurants, etc. We drove to the Isle of Wight Ferry parking lot to take the ferry over for the day which was easy and convenient. We had stayed here before and will come back again.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-13",
    "reviewer_name": "Phil",
    "star_rating": 5.0,
    "review_text": "=== Overnight treat in lovely Lymington ===\nLiked: I decided to pay more than usual for an overnight stay at Stanwell House as a treat for my wife. It was well worth it-the excellent friendly staff, the free room upgrade  the breakfast  the High Street location and the beautifully refurbished hotel all top notch",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-10",
    "reviewer_name": "Barry",
    "star_rating": 4.0,
    "review_text": "=== Short break ===\nLiked: The hotel was nice. The room was also good\nDisliked: Some of the staff were not as well trained in serving the evening meal as they should have been",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-03",
    "reviewer_name": "Esther",
    "star_rating": 5.0,
    "review_text": "=== Recommended spot, surprising find. Overnight stay a real treat… ===\nLiked: Location was fabulous. Beautiful property, comfy beds and great food. Excellent staff… \n\nWe were upgraded too, what a treat!\nDisliked: Nothing, a larger parking space would be ideal, but a main car park alongside did the trick..",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-03",
    "reviewer_name": "Ruth",
    "star_rating": 4.5,
    "review_text": "=== Loved it ===\nLiked: Decor beautiful\nDisliked: Twin beds pushed together never as good as a proper superking.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-31",
    "reviewer_name": "Maria",
    "star_rating": 5.0,
    "review_text": "=== Would definitely return to Stanwell House ===\nLiked: Excellent and friendly staff and excellent location",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-30",
    "reviewer_name": "Kathryn",
    "star_rating": 5.0,
    "review_text": "Liked: Nice atmosphere-friendly staff",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-23",
    "reviewer_name": "Yvonne",
    "star_rating": 4.5,
    "review_text": "=== Very relaxing and friendly staff, would definitely stay again. ===\nLiked: Lovely hotel extremely well located, friendly staff and the breakfast and the room was beautiful.\nDisliked: The staff in the bar seemed a little overwhelmed, however we were still able to enjoy a couple of lovely cocktails before dinner.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-16",
    "reviewer_name": "Ellen",
    "star_rating": 5.0,
    "review_text": "=== A lovely warm and friendly hotel and feels like home ===\nLiked: Breakfast is served in the orangery which looks out over the garden. The food choice is wide and caters for all tastes and requirements. This visit I had the full English which was lovely\nDisliked: Nothing I don’t like about our visit just wish it was more often and longer",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-16",
    "reviewer_name": "Jo",
    "star_rating": 5.0,
    "review_text": "Liked: Beautifully decorated hotel. Unique and stylish. Very friendly and helpful staff.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-14",
    "reviewer_name": "Nick",
    "star_rating": 5.0,
    "review_text": "=== Perfectly situated in a lovely town, excellent staff. ===\nLiked: Very friendly staff, great ambience.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-09",
    "reviewer_name": "Elinor",
    "star_rating": 5.0,
    "review_text": "=== Amazing stay ===\nLiked: Beautiful place and the staff were exceptional. Gorgeous room and the breakfast is delicious.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-06",
    "reviewer_name": "Ben",
    "star_rating": 5.0,
    "review_text": "=== Overall a wonderful stay ===\nLiked: Food and ambience excellent\nDisliked: Bathroom cleanliness",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-20",
    "reviewer_name": "Denise",
    "star_rating": 5.0,
    "review_text": "Liked: The property was very well run and the staff were lovely",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-17",
    "reviewer_name": "Jack",
    "star_rating": 5.0,
    "review_text": "=== Fantastic stay at Stanwell house ===\nLiked: Furnishings were lovely and staff really friendly\nDisliked: Didn’t bring toothpaste with us and there was none in the room",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-14",
    "reviewer_name": "Rosalind",
    "star_rating": 5.0,
    "review_text": "=== The hotel was in a prime position. The staff were really friendly & helpful ===\nLiked: Unique & quirky. Tastefully decorated.\nDisliked: O",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-07",
    "reviewer_name": "Noreen",
    "star_rating": 2.0,
    "review_text": "=== Christmas package à big disappointment! Left upset and felt cheated. ===\nLiked: Location is fabulous \r\nThé Hôtel Rooms were clean/comfortable beds\nDisliked: Christmas lunch was awful!                          Starter: Beetroot Risotto (tasteless) We ate some bread rolls instead.\r\nMains:\r\n- Reheated Roast Potatoes \r\n-Turkey Roll (not from à bird)\r\n- Greasy Yorkshire pudding\r\nAll we ate from the mains was the Brussels Sprouts\r\nThé Christmas pudding was fine.\r\nThere were issues with breakfast thé following morning. The waiters indicated that there were problems in the kitchen.\r\nHence we left and headed to the Haven for our breakfast.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-07",
    "reviewer_name": "Ruth",
    "star_rating": 4.5,
    "review_text": "Liked: All food from the restaurant was lovely.  The service was good.  Tastefully decorated.\nDisliked: Nothing - everything was lovely.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-06",
    "reviewer_name": "Steve",
    "star_rating": 5.0,
    "review_text": "=== Wonderful ===\nLiked: We were very pleased with the hotel. The communal spaces were comfortable and the staff very helpful. We thoroughly enjoyed our stay.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-03",
    "reviewer_name": "Frazer",
    "star_rating": 5.0,
    "review_text": "=== A beautiful boutique hotel in a stunning location. ===\nLiked: Wonderful location and beautifully decorated. The staff were absolutely lovely and very attentive. The rooms were really comfortable and tastefully furnished.\nDisliked: N/A",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-03",
    "reviewer_name": "Charlotte",
    "star_rating": 5.0,
    "review_text": "Liked: We had a fantastic stay,  all the staff were lovely, and the location was perfect.\nDisliked: Nothing",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-02",
    "reviewer_name": "Richardcoleman",
    "star_rating": 4.5,
    "review_text": "=== Excellent few days at Stanwell House ===\nLiked: A very well-appointed hotel set in the centre of Lymington, beautifully decorated. Very attentive staff and good food.Highly recommend.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-19",
    "reviewer_name": "Sarah",
    "star_rating": 5.0,
    "review_text": "=== Excellent and would highly recommend, looking forward to returning when next in the area. ===\nLiked: Staff were excellent, the food was delicious and Sandra sorted everything out for us when we encountered an issue.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-13",
    "reviewer_name": "Helen",
    "star_rating": 5.0,
    "review_text": "=== Friendly and comfortable ===\nLiked: Lovely atmosphere. Staff friendly and very efficient. Room excellent. Definitely be going back again\nDisliked: Parking",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-11",
    "reviewer_name": "Richard",
    "star_rating": 5.0,
    "review_text": "Liked: Lovely decor. Excellent position.  Our third stay.  Didn't take the breakfast option this time because meeting family locally, but it was excellent last time.\nDisliked: There was a power cut for a few hours affecting the whole street.  Actually it was quite fun",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-06",
    "reviewer_name": "Andre",
    "star_rating": 5.0,
    "review_text": "=== A beautiful location to complement a beautiful hotel ===\nLiked: I’ve always loved Stanwell House, I regularly visit for lunch with my sisters, I’ve heard they do afternoon teas so I’ll definitely be visiting for one of them too one day\nDisliked: There really isn’t nothing to dislike, all the Team were amazing, we had a wonderful stay",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-05",
    "reviewer_name": "Ternstrom",
    "star_rating": 4.5,
    "review_text": "Liked: Beautiful property and interiors. Lovely staff. Great view of the bay.\nDisliked: We were in room 38 at the top of the building so the water in the shower were a bit unreliable. Took about 3-4 minutes for pressure to work. Breakfast could be improved, the cooked option tasted nice but small portion. Fruit platter looked a bit sad too.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-02",
    "reviewer_name": "Deborah",
    "star_rating": 5.0,
    "review_text": "=== Perfect location, great service and attention to details, beautiful decor, would highly recommend! ===\nLiked: Beautiful and thoughtful decor, cosy room very comfortable and perfect location in the centre of Lymington High Street!\nDisliked: Instructions for the car park were clearly given however I arrived just as it was getting dark and it was difficult to see.  The sign for the car park is very faded and I needed to ask someone how I could reach the hotel.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-01",
    "reviewer_name": "Amber",
    "star_rating": 4.5,
    "review_text": "Liked: Fabulous location, welcoming staff and great experience.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-31",
    "reviewer_name": "Linda",
    "star_rating": 4.5,
    "review_text": "=== Relaxing few days away ===\nLiked: Lovely atmosphere , friendly,  clean , good location\nDisliked: Noise from bar at night",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-29",
    "reviewer_name": "Tony",
    "star_rating": 5.0,
    "review_text": "=== Treat for post Xmas ===\nLiked: Modern property but with character, rooms tastefully decorated and furnished. Staff all very friendly, Dinner and breakfast excellent. Cocktails in the salt bar were excellent with plenty of choice.\nDisliked: Nothing to add, no dislikes",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-27",
    "reviewer_name": "Christopher",
    "star_rating": 5.0,
    "review_text": "=== Excellent throughout, nothing was too much trouble! ===\nLiked: The whole experience was excellent. Not cheap, but we got what we had paid for! Staff, food, room and ambiance were excellent.\nDisliked: To be really picky, too many cushions in the bedroom!",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-21",
    "reviewer_name": "Karen",
    "star_rating": 4.5,
    "review_text": "=== Date Night ===\nLiked: loved the cosy room very quiet, perfect for an overnight stay.\nDisliked: We liked everything!",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-17",
    "reviewer_name": "Craig",
    "star_rating": 0.5,
    "review_text": "=== Best to forget the non event ===\nLiked: Nothing\nDisliked: Everything",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-16",
    "reviewer_name": "Jacqueline",
    "star_rating": 4.5,
    "review_text": "=== Great hotel in a great location ===\nLiked: Beautiful renovation and very friendly staff\nDisliked: There seemed to be a slight drain smell in our room (12) however my husband couldn’t smell it.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-14",
    "reviewer_name": "Laurence",
    "star_rating": 5.0,
    "review_text": "Liked: We stayed at Stanwell  House Hotel to celebrate an anniversary.\r\n\r\nIt’s a delightful hotel in the heart of Lymington amidst shops cafes pubs and restaurants. Our warm quiet  room  was very well furnished and decorated, with attention to detail. It overlooked a garden terrace, well lit and quiet in  stormy December\r\n\r\n Staff were very warm friendly and welcoming. The pride with which our room was cared for by  housekeepers was noticeable. All that we used was  refilled each day. Delivering fresh milk to our room each morning was a lovely touch.\r\n\r\n The breakfast menu was large and varied and again staff were very attentive to guests needs. We were able to linger and avoid the storms,  as there was plenty of space to accommodate all residents.\r\nThe bars were busy early in the evening but once casual dinners departed the hubbub subsided. We  enjoyed drinking in The Salt bar with its  log  burning  stove, although prices were on the high side.\r\nOver our long weekend we only dined in the hotel once. The meal was excellent and the portions substantial. Good value for money given the quality on offer.\r\n\r\nWe loved our brief say in Lymington and plan to return to the excellent Stanwell House Hotel  in the year to come.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-10",
    "reviewer_name": "Paddy",
    "star_rating": 5.0,
    "review_text": "=== Great in every way. ===\nLiked: Our stay was perfect I every way. It is a lovely hotel in an ideal location and staff were all So helpful. Thanks\nDisliked: Nothing it was all",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-02",
    "reviewer_name": "Amelia",
    "star_rating": 5.0,
    "review_text": "=== Fantastic exceeded our expectations, lovely hotel and staff. ===\nLiked: A friendly comfortable well positioned hotel with exceptional staff. Excellent breakfast and evening meal.\nDisliked: Nothing",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-01",
    "reviewer_name": "Charlotte",
    "star_rating": 5.0,
    "review_text": "=== A festive wonderland! ===\nLiked: The festive decor was amazing! Absolutely gorgeous. The room was cosy and comfortable, and a perfect location to explore Lymington.\nDisliked: The only thing is that it was a little difficult to find the car park. Perhaps a bit of extra info and a map on the website would be helpful?",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-28",
    "reviewer_name": "Robert",
    "star_rating": 4.5,
    "review_text": "Liked: We did not have breakfast at the hotel",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-27",
    "reviewer_name": "Jackie",
    "star_rating": 5.0,
    "review_text": "=== We were meeting family for a celebration. The hotel made this birthday surprise perfect. ===\nLiked: Location was perfect for the harbour. Staff were extremely friendly and the room was exceptional.\r\n\r\nAs this was a birthday surprise we were given a room uograde.\nDisliked: The car park was a little far away from the hotel. I do realise this is a problem that cannot be better placed.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-26",
    "reviewer_name": "Jo",
    "star_rating": 4.0,
    "review_text": "=== Nice weekend away with great friends ===\nLiked: lovely breakfast selection to order from, great bar area and food\nDisliked: very slow breakfast service. the toast and extra tea never arrived",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-21",
    "reviewer_name": "Jennifer",
    "star_rating": 3.5,
    "review_text": "Liked: Location, comfortable beds, fresh milk in the morning\nDisliked: Breakfast ends too early on the weekend",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-21",
    "reviewer_name": "Fergus",
    "star_rating": 4.0,
    "review_text": "Liked: There was noise from the next door room late at night - apart from that, everything was great.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-19",
    "reviewer_name": "Alice",
    "star_rating": 4.5,
    "review_text": "=== Lovely Lymington never disappoints ===\nLiked: This is our fourth stay at Stanwell, and the first since the refurbishment.  The hotel looks fabulous and has a great vibe.  All the staff were so friendly and welcoming. Excellent bar manager Zach, and Ben.  Front of house were very helpful (sorry I didn't get their names)\r\nWill definitely come back.\nDisliked: We were upgraded to room 24 which was beautiful however right above the bar and at the front so a bit noisy at night.  And very warm!\r\nHowever, it was still lovely and we appreciated the upgrade.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-18",
    "reviewer_name": "Steve",
    "star_rating": 5.0,
    "review_text": "=== We couldn't have chosen anywhere to spend our anniversary. We will return! ===\nLiked: Friendly and very helpful staff - without exception. Thank you!\r\nThe full English breakfast was hot throughout when it reached the table. Important and we liked that.\r\nComfortable and clean room. Great bathroom!\r\nOur visit was for an anniversary. The hotel knew about it in advance and left us a lovely card to welcome us on our arrival. Lovely touch. Thank you.\nDisliked: Nothing.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-17",
    "reviewer_name": "Fergus",
    "star_rating": 4.0,
    "review_text": "=== A great place from which to explore the New Forest ===\nLiked: Easy to find, good location on the high street\nDisliked: Room was too warm",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-17",
    "reviewer_name": "Dean",
    "star_rating": 5.0,
    "review_text": "Liked: Lovely decor and very warm and\nWelcoming",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-16",
    "reviewer_name": "Graham",
    "star_rating": 5.0,
    "review_text": "=== Fabulous celebration at Stanwell House  Hotel ===\nLiked: We were given a very warm welcome by Lucy on reception. She immediately offered an upgrade when we told her we were celebrating my 70th birthday. The whole hotel is decorated to the highest standards. Our room was fabulous luxury super king bed that was so comfortable. Great pillows linen towels etc. We had drinks on both nights in the Salt Bar and were looked after by a super attentive friendly bar tender Marino. \nWe had breakfast and this was also top notch lots of choice and once again very attentive staff. On my birthday we ate in the Samphire restaurant it was superb. Lovely atmosphere and once again great staff. They even provided me with a surprise gift that was a nice touch. This is a fabulous hotel made all the better by superb friendly staff. I have no hesitation in recommending this place and will definitely be back.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-15",
    "reviewer_name": "Day",
    "star_rating": 5.0,
    "review_text": "Liked: Beautiful  hotel  exceptional  staff fabulous  room \nLovely  location  excellent  breakfast\nDisliked: Nothing",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-14",
    "reviewer_name": "Nan",
    "star_rating": 5.0,
    "review_text": "=== The Epitome of a High Class Boutique Hotel ===\nLiked: Excellent Boutique Hotel in the heart of Lymington , perfect location on the High Street,, fabulous decor ,furnishings and ambience , great attention to detail .\nThe most comfortable beds, luxurious duvets and pillows .\nLovely Bar and Restaurant, amazing food and service. Superb Breakfast\nVery highly recommended .",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-14",
    "reviewer_name": "Karen",
    "star_rating": 4.0,
    "review_text": "=== Beautifully renovated hotel in a perfect location trying hard to please but maybe needs some further attention to guest ===\nLiked: Great central location for exploring. Beautiful decoration good atmosphere.\nDisliked: Car Park directions needs to be better and car owners need to be advised how to position their car to allow more guests to have access to such a small car park. Bar staff seemed under pressure as quite a few delays in receiving drinks some orders completely forgotten. Breakfast food not hot. Bedroom lovely but noisy from street.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-14",
    "reviewer_name": "Susan",
    "star_rating": 4.0,
    "review_text": "=== Perfect location, needs a toaster. ===\nLiked: The property is beautiful, very nicely decorated and in an ideal location right in the middle of town. The rooms were very well equipped, comfortable and quiet. The staff were very accommodating and friendly.\nDisliked: Although the staff were lovely there don’t seem to be quite enough of them allocated to serve breakfast, so there was a long wait - especially for toast! Put a toaster on the buffet so we can get on with it ourselves. The hot food that you can order was delicious and the buffet for the continental option was reasonable although it’s expensive if that’s all you have.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-01",
    "reviewer_name": "Caroline",
    "star_rating": 5.0,
    "review_text": "=== Great location. Lovely staff. Perfect for a short Lymington stay. ===\nLiked: Classic, well maintained with friendly staff.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-29",
    "reviewer_name": "Maurice",
    "star_rating": 5.0,
    "review_text": "=== Excellent looking forward to our next visit ===\nLiked: Room very comfortable overlooking the main high street. Very little traffic so no disturbance. Breakfast very good . We were travelling to IOW next day super location. We will come again\nDisliked: nothing",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-28",
    "reviewer_name": "Robert",
    "star_rating": 4.5,
    "review_text": "=== Super hotel in great location, thank you. ===\nLiked: Great dinner, room, amenities.\nDisliked: Chilli in avocado for breakfast.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-26",
    "reviewer_name": "Jane",
    "star_rating": 5.0,
    "review_text": "=== wonderful stay ===\nLiked: beautiful hotel in a great location. loved the decor and how comfortable it was\nDisliked: nothing",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-23",
    "reviewer_name": "Bem",
    "star_rating": 4.5,
    "review_text": "=== Excellent, lovely staff. ===\nLiked: Comfortable, lovely bar.\nDisliked: Couldn’t get a thinner pillow",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-21",
    "reviewer_name": "Hillier",
    "star_rating": 5.0,
    "review_text": "=== I would definitely stay there again as the whole experience exceeded my expectations. ===\nLiked: The hotel was beautiful, with exceptional hospitality, clean and comfortable rooms and the rates are reasonable. \r\nThere were a good selection of pubs and restaurants within walking distance.\nDisliked: The uncertainty of getting a car parking space.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-21",
    "reviewer_name": "Helpfultravelling",
    "star_rating": 4.0,
    "review_text": "=== Pretty, centrally based, hotel with lovely staff ===\nLiked: Very nice comfortable quintessentially British decor, rooms cosy & comfortable, staff great\nDisliked: nothing specific - a good boutique hotel",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-21",
    "reviewer_name": "Sarah",
    "star_rating": 4.5,
    "review_text": "=== I thoroughly recommend this hotel for a long weekend on the coast ===\nLiked: Attractive decor, lovely warm comfortable room, perfect venue for exploring the town and local area",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-20",
    "reviewer_name": "Jessica",
    "star_rating": 5.0,
    "review_text": "Liked: Staff- amazing across the board from reception to the amazing bar \r\nRoom-beautiful\r\nwill return",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-20",
    "reviewer_name": "Noel",
    "star_rating": 5.0,
    "review_text": "=== Lovely mini break hotel ===\nLiked: A beautiful hotel and fab staff",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-17",
    "reviewer_name": "Jonathan",
    "star_rating": 5.0,
    "review_text": "=== An Ideal Choice ===\nLiked: Excellent central location. Renovation appeared recent but without any loss of character. Very friendly.\nDisliked: More obvious signing of the car park.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-16",
    "reviewer_name": "John",
    "star_rating": 4.5,
    "review_text": "=== Great hotel, great food, great room. Enthusiastic staff but let down by poor management during busy ===\nLiked: Room and food is excellent\nDisliked: Bar service and lack of management during busy periods.  Staff very enthusiastic and hardworking but not well managed to get the most effective use of the staff.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-13",
    "reviewer_name": "Debbie",
    "star_rating": 3.5,
    "review_text": "=== A pleasant stay in Lymington in a very central location ===\nLiked: Very central, pleasant furnishings, food in the restaurant very good.  Staff helpful and friendly\nDisliked: In the mornings it was quite noisy.  We were in Rm 29 above the restaurants and we were woken both mornings with doors banging whilst we presume breakfast was being set up.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-13",
    "reviewer_name": "Paula",
    "star_rating": 4.5,
    "review_text": "=== Perfect birthday celebration get-away ===\nLiked: Fab cocktails in the bar. Beautiful orangery for breakfast. Room was lovely and the location perfect\nDisliked: I wished there had been a safe in the room for valuables",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-12",
    "reviewer_name": "Alan",
    "star_rating": 4.0,
    "review_text": "=== Really pleasant overall ===\nLiked: Mattress and pillows - what brand and type were they?!\nDisliked: Bar service. Car park",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-11",
    "reviewer_name": "Anne",
    "star_rating": 4.5,
    "review_text": "Disliked: The car parking was challenging. I asked before arriving about it but the instructions were very unclear",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-09",
    "reviewer_name": "Martyn",
    "star_rating": 5.0,
    "review_text": "=== Excellent service/food /accomodation in a wonderful hotel ===\nLiked: Very lovely renovation decor was superb all the staff were very attentive the bar was exceptional nothing was to much trouble for the barman he would mix you a drink even if it wasn’t on the menu everything was walking distance to the hotel\nDisliked: Nothing",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-09",
    "reviewer_name": "Anthony",
    "star_rating": 4.5,
    "review_text": "=== Loved it ===\nLiked: Food was lovely, hotel was cute and original and staff we're excellent with pretty much all staff congratulating us on our anniversary. It's the little touches that matter and this hotel did not disappoint. Would also highly recommend the puffin boat tour in the harbour!",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-09",
    "reviewer_name": "Eleftherios",
    "star_rating": 4.0,
    "review_text": "=== very pleasant ===\nLiked: Staff very polite and friendly. Room clean.\nDisliked: Food and drinks a little pricey. Room a bit small.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-06",
    "reviewer_name": "Judith",
    "star_rating": 4.0,
    "review_text": "=== We would all certainly stay again. ===\nLiked: Beautiful hotel - very stylish and an excellent location.\nDisliked: Breakfast service was a bit hit and miss.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-04",
    "reviewer_name": "Ros",
    "star_rating": 4.5,
    "review_text": "=== Luxurious hotel with lovely food and excellent staff ===\nLiked: Great situation  lovely staff and good staff numbers",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-03",
    "reviewer_name": "Dave",
    "star_rating": 4.5,
    "review_text": "=== Lovely stay, lovely staff albeit a little on the expensive side ===\nLiked: Great location and a lovely ambience\nDisliked: Nothing",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-02",
    "reviewer_name": "Karen",
    "star_rating": 4.5,
    "review_text": "=== Super location a beautiful building with character close to local attractions for strolling out ===\nLiked: Perfect location for Lymington \nVery clean \nBeautiful decoration\nDisliked: Car parking is not near the property and description on how to find and its actual location to the property needs improving.\n\nNoise from street and bar in our bedroom.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-30",
    "reviewer_name": "Ian",
    "star_rating": 4.0,
    "review_text": "=== We liked it so much we'll be back soon. ===\nLiked: Relaxed atmosphere, professional and warm nature of the team. Great location.\nDisliked: Dinner was great but the service at breakfast was poor. Our food was served cold and Staff didn't clear away used bowls, cups etc",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-29",
    "reviewer_name": "Sandy",
    "star_rating": 5.0,
    "review_text": "=== Highly recommended ===\nLiked: Great location  - beautiful hotel - super facilities",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-28",
    "reviewer_name": "Helen",
    "star_rating": 5.0,
    "review_text": "=== Comfortable and luxurious ===\nLiked: Stayed a few times always great service and food very friendly staff",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-26",
    "reviewer_name": "Susan",
    "star_rating": 4.5,
    "review_text": "=== Will definitely return! ===\nLiked: Beautifully decorated\nDisliked: Breakfast not as nice as other places we’ve stayed in ie Hever Castle",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-24",
    "reviewer_name": "Janet",
    "star_rating": 5.0,
    "review_text": "=== Wonderful ===\nLiked: Breakfast was delicious - good value with plenty of choice. Hotel staff very friendly & extremely attentive",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-23",
    "reviewer_name": "Kellie",
    "star_rating": 4.0,
    "review_text": "=== good stay in the centre of Lymington ===\nLiked: breakfast was good and beds were really comfy\nDisliked: The room was very tiny for the price",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-22",
    "reviewer_name": "Peter",
    "star_rating": 4.5,
    "review_text": "=== Lovely old school hotel in a great location. ===\nLiked: Location, decor quality, staff.\nDisliked: Could do with air con, tv reception poor.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-21",
    "reviewer_name": "Susan",
    "star_rating": 4.5,
    "review_text": "=== Luxurious. Will return. ===\nLiked: Beautiful furnishings and so tasteful\nDisliked: Breakfast not quite as good as expected.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-20",
    "reviewer_name": "Olivia",
    "star_rating": 4.5,
    "review_text": "=== Expensive, but thoughtful quality. ===\nLiked: Very well appointed rooms with real luxury finishes. Extremely comfortable bed. Price was very high but you got to feel the reason for some of the difference.\nDisliked: Couldn't get wifi to work on my laptop although it did for other devices. Didn't like the radio in the room (was on when I came in and my elderly parents in another room were woken at 07.00 by the one in the room next door/ downstairs and could do nothing about it). Continental breakfast choices were underwhelming.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-17",
    "reviewer_name": "Chris",
    "star_rating": 4.5,
    "review_text": "=== Delightful staff and superb location ===\nLiked: The main thing we appreciated was the superb staff who were at all times delightful, courteous and efficient. We enjoyed the high standard of comfort in the room. The breakfast was enjoyable. The hotel has an excellent location in the middle of Lymington, close to the rail station.\nDisliked: I have to say that £285 a night for a hotel room (excluding breakfast) is well above what I would normally consider. Yes, the hotel is excellent but I do find it difficult to understand this high rate.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-16",
    "reviewer_name": "Caroline",
    "star_rating": 5.0,
    "review_text": "=== I would definitely recommend the hotel, there was parking available, which is always a bonus, ===\nLiked: The room was lovely , bed was lovely and comfortable, bathroom and towels were excellent, bath and shower products were a nice bonus, there was plenty of tea coffee, hot chocolate and biscuits in the room.\r\nThe breakfast was a great selection, hot and cold. The bar area and restaurant where really lovely area to relax.\r\nThe hotel staff were always on hand 24/7 if needed, newspapers delivered to your room and fresh milk each morning",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-16",
    "reviewer_name": "Maureen",
    "star_rating": 5.0,
    "review_text": "=== Will definitely stay again! ===\nLiked: Location staff comfort although room a little small for two people\nDisliked: Room",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-10",
    "reviewer_name": "Mark",
    "star_rating": 4.5,
    "review_text": "=== Excellent stay in a beautiful hotel ===\nLiked: Excellent hotel with a very comfortable room, good breakfast and dinner, in a very central position. We even managed to park in the small car park\nDisliked: Not much, the rooms are quite compact. Breakfast was tasty but not hot",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-09",
    "reviewer_name": "Lisa",
    "star_rating": 4.5,
    "review_text": "=== Exceptional customer service, delicous food and beautiful decor. Would recommend! ===\nLiked: Service exceptional. Very attentive and helpful staff. Beautiful hotel that has been exquisitely decorated. Food delicious. Had dinner and breakfast. Breakfast was particularly impressive and excellent value for money. The eggy brioche with crispy bacon and maple syrup was superb! Fantastic location right in the centre of town.\nDisliked: I had one of the cheaper rooms in the attic. The low ceiling was a problem as I bumped my head a couple of times. I would recommend spending a bit more for a better room!",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-07",
    "reviewer_name": "Peter",
    "star_rating": 3.5,
    "review_text": "Liked: Friendly staff, great location\nDisliked: Small bed, very restricted ceiling height in most of the room",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-05",
    "reviewer_name": "Anthony",
    "star_rating": 5.0,
    "review_text": "=== Fantastic experience. ===\nLiked: Breakfast was delicious, with a good choice.   Ideal location.  Wonderful decor (beautifully designed).\nDisliked: It would have been nice to have an additional chair in our room.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-02",
    "reviewer_name": "Matt",
    "star_rating": 5.0,
    "review_text": "=== Relaxation, quality hotel and staff excellent ===\nLiked: Location was great, hotel excellent\nDisliked: Nothing",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-30",
    "reviewer_name": "Leigh",
    "star_rating": 3.5,
    "review_text": "Liked: Nicely appointed. Great location. Lovely garden to rear of property with garden bar. Hotel furnished well.\nDisliked: No airconditioning. Sadly our meal in the restaurant was not good. My husband ordered the £30 steak and,asked for it to be medium rare but sadly served as tough as anything abd,had to be returned to the kitchen which given the fact the restaurant wasn't even half full isn't up to what you would expect. Fortunately, the staff member arranged that we where not charged for hus meal as by the time he received his replacement I had already finished.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-28",
    "reviewer_name": "Catriona",
    "star_rating": 4.0,
    "review_text": "=== Most enjoyable ===\nLiked: Excellent dinner\nDisliked: The coffee",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-28",
    "reviewer_name": "Ross",
    "star_rating": 4.0,
    "review_text": "=== Go to place for a stay in Lymington ===\nLiked: Great place in super location. Excellent food and comfortable rooms",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-27",
    "reviewer_name": "Helen",
    "star_rating": 4.0,
    "review_text": "=== We enjoyed it! ===\nLiked: Room decor was lovely. Location was great. Garden was lovely. Staff v helpful and friendly. Shower was great. Bar was good.\nDisliked: Cold breakfast options were limited. Bread and fresh fruit would have been nice. A variety of cheese and meats would be better. \r\nThe key was a bit annoying. \r\nThe toilet didn’t refill quickly. \r\nWasn’t a fan of the shampoo or conditions in the shower.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-27",
    "reviewer_name": "Linda",
    "star_rating": 4.0,
    "review_text": "=== Quite expensive overall but lovely rooms, good food and a nice ambience.  I would consider staying again. ===\nLiked: Beautifully furnished and very clean.  Excellent food.\nDisliked: Slow drinks service - staff needed constant chasing to get your drinks.  We couldn’t work out why - there seemed to be some sort of communication breakdown between the waiting and bar staff.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-27",
    "reviewer_name": "Sonia",
    "star_rating": 5.0,
    "review_text": "Liked: Stunning hotel right in the middle of town - couldn’t fault a thing!",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-22",
    "reviewer_name": "Marie",
    "star_rating": 4.0,
    "review_text": "=== Staff fabulous, room fantastic but food was cheapened ===\nDisliked: Restaurant food from last year had definitely declined, steak was tuff and not worth the money unfortunately",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-22",
    "reviewer_name": "Jaime",
    "star_rating": 4.5,
    "review_text": "=== Very lovely, would recommend ===\nLiked: Beautiful interior and lovely food made with good quality ingredients.\nDisliked: I hate to have criticism but feedback helps. The main bar tender was excellent but on his own which meant the bar was strewn with dirty glasses needing clearing away which you don’t want to see when ordering nice drinks at a premium price. The only other piece of feedback the haddock for breakfast was almost ridiculous when it arrived, the tiniest piece of fish and only one egg even though the description described eggs plural. It was the same price as everything else but was unacceptable in terms of a portion, so much so it felt like a mistake. All other breakfasts were perfect but this dish needs to be reconsidered.  Final point the air con machine didn’t work well which would be more of a problem had the weather been hotter",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-20",
    "reviewer_name": "Gillian",
    "star_rating": 4.0,
    "review_text": "=== Good central position ===\nLiked: Decor of common areas and in bedroom very nice. Breakfast was excellent. Staff very attentive. Nice being offered fresh milk for room.\nDisliked: Our room (37) was too hot even with the portable fan. Unable to put Ac in some parts of hotel.  Would have thought at the price of room, they would have a better alternative. Step access to our room.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-20",
    "reviewer_name": "Richard",
    "star_rating": 4.5,
    "review_text": "Liked: Location",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-20",
    "reviewer_name": "Andrew",
    "star_rating": 4.5,
    "review_text": "=== Super comfortable Hotel with Good vibe ===\nLiked: Great Location with Lovely Garden",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-19",
    "reviewer_name": "Christopher",
    "star_rating": 5.0,
    "review_text": "=== The perfect central location for a relaxing and sophisticated stay ===\nLiked: Sophisticated, Welcoming and a lovely warm feel\nDisliked: Nothing apart from the fact we had to leave",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-17",
    "reviewer_name": "Richard",
    "star_rating": 5.0,
    "review_text": "=== Everything was just perfect in all respects. ===\nLiked: Clean and lovely interior design well maintained\nDisliked: Nothing",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-16",
    "reviewer_name": "Joanne",
    "star_rating": 3.0,
    "review_text": "=== The bed was comfortable, the food was reasonable,  bar service was slow, shower was not hot. ===\nLiked: Very comfortable bed, good location\nDisliked: My shower was lukewarm and when I mentioned it at reception, they said it was controlled by a switch outside the bathroom door. No one had mentioned that when I checked in so how was I supposed to know..",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-16",
    "reviewer_name": "Mark",
    "star_rating": 4.0,
    "review_text": "=== Very enjoyable place to stay ===\nLiked: Location and nicely presentex\nDisliked: no air conditioning, at this level I was disappointed.Restaurant staff were disorganised money lost as owing lederhosen never received !",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-12",
    "reviewer_name": "Caroline",
    "star_rating": 3.0,
    "review_text": "Liked: Lovely garden and room\nDisliked: Felt all staff  were very young and needed a more mature person for guidance.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-10",
    "reviewer_name": "Kim",
    "star_rating": 3.0,
    "review_text": "=== Nice but not good value for money. ===\nLiked: Staff. Room.\nDisliked: Value for money.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-08",
    "reviewer_name": "Anthony",
    "star_rating": 4.0,
    "review_text": "=== Wonderful hotel, but with too many young and inexperienced staff needing more trining and support. ===\nLiked: Loved the decor, fresh, modern and classy. Very tasteful, comfortable room with pretty view of the garden. Coffee bags rather than the usual instant stuff and fresh milk provided. Wonderful toiletries. Excellent touches.\nDisliked: First allocated room smelled strongly of cigarette smoke and with a view of the top of the huge parasol. Not a garden view. We noticed an ice bucket with champagne. Fortunately, we happened to ask about this when we had moved to a better room and discovered it had been provided by our daughter. There was no note, so we found out by chance. Otherwise we would not have received this lovely surprise.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-04",
    "reviewer_name": "Louise",
    "star_rating": 4.0,
    "review_text": "=== Good town location with easy access to the new forest ===\nLiked: Great location close to the quayside with an excellent restaurant and bar.\nDisliked: We were lucky to have good weather but our room was very hot with only a small window for air and although there was a fan it didn’t seem to cool down. We would have benefited from a small fridge in our room.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-04",
    "reviewer_name": "Kerrie",
    "star_rating": 5.0,
    "review_text": "=== Excellent, would certainly recommend and would love to come back. ===\nLiked: Stunning property everything is of a high standard.\nDisliked: Nothing",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-26",
    "reviewer_name": "Jo",
    "star_rating": 4.5,
    "review_text": "Liked: Beautifully decorated room",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-23",
    "reviewer_name": "Tijen",
    "star_rating": 5.0,
    "review_text": "=== Perfect location, perfect town location, beyond perfect staff from front of house, chefs, bar staff to senior members - ===\nLiked: Most importantly the staff were superb and couldn’t do enough for you. The quality of the food was wow so for sure eat in the restaurant. The decor was very soho house vibe !\nDisliked: One bedroom/bed was particularly small but dealt with immediately",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-17",
    "reviewer_name": "Steve",
    "star_rating": 4.5,
    "review_text": "=== A charming hotel with wonderful staff. So relaxing. We really enjoyed our breakfast, great service and no hassle. ===\nLiked: Fantastic location and wonderful staff\nDisliked: Rooms really need air conditioning as standard and not an added charge",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-16",
    "reviewer_name": "Christopher",
    "star_rating": 5.0,
    "review_text": "=== An exceptional stay ===\nLiked: From the moment we walked in we were treated like royalty. This is a sophisticated and classy hotel. Centrally located it was totally ideal for getting to the places we wanted to visit.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-16",
    "reviewer_name": "Andrew",
    "star_rating": 4.0,
    "review_text": "Liked: Comfortable and clean. Excellent staff. Very tasty breakfast. There are a variety of guest areas with different feels to them, we enjoyed a drink in the bar before dinner in the Samphire restaurant with views in to the garden. The Orangery is lovely and bright.\nDisliked: Although we visited in July it wasn’t a hot day (18degrees). The room was very hot which meant sleeping was difficult. A fan had been provided but had only minimal effect.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-15",
    "reviewer_name": "Andrew",
    "star_rating": 3.5,
    "review_text": "=== It could be brilliant - but let down by an entitled and rude member of the bar staff. ===\nLiked: Overall - fantastic location, nice character hotel, reasonable facilities, great food...\nDisliked: Service was highly patchy,  never exceptional, and on one occasion downright obnoxious. In comparison it is nothing like Lime Wood, a few miles away, for example. In particular our drinks were served very late for dinner - the aperitif arrived when I was finishing my starter missing the point of an aperitif. The wine was delayed until well into the main course. I pointed out the delayed aperitif to the member of staff who served it who said condescendingly “it’s not my fault - I work in the bar” as if it was funny and that somehow made it OK. He did not take my observation seriously. A minor altercation followed - I made the point it doesn’t matter where he worked in the hotel but he continued being defensive with his “it’s not my fault, I only work in the bar” excuse - he was patronising and obnoxious. Note a manager did apologise on his behalf - the hotel really need to re-train this guy in the basics of dealing with customers because I can see him being a problem….he clearly doesn’t value the customers.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-13",
    "reviewer_name": "Ken",
    "star_rating": 4.0,
    "review_text": "=== Very central hotel and very clean. A bit expensive with no extras eg pool ===\nLiked: Very clean and modern. Good breakfast\nDisliked: Very small bedroom, must have a good photographer as seem much bigger in advertisements",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-08",
    "reviewer_name": "Lisa",
    "star_rating": 4.5,
    "review_text": "=== Charming, beautifully executed service ===\nLiked: The hotel is beautifully decorated, in a fantastic central location. The service was always excellent with friendly attentive staff. The breakfast was perfect too. We ate in the restaurant on the Friday- all the dishes in our large party were delicious. Again lovely service.\nThe bar is great, again with beautiful decor and cosy corners.\nOur bedroom was delightful with a separate sitting room and sunny roof terrace.\nDisliked: Our only fault was it was a little warm in our room, despite the large window being open. But tiny issue, everything else was super.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-08",
    "reviewer_name": "David",
    "star_rating": 4.0,
    "review_text": "=== Nice hotel, quality, felt it was slightly expensive for what it was though ===\nLiked: Location, breakfast, cleanliness, quality of room\nDisliked: Parking was full, had to pay and display and got a ticket, service was little slow at times",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-29",
    "reviewer_name": "Frank",
    "star_rating": 5.0,
    "review_text": "=== Loved the hotel, its style, cleanliness and friendly and helpful staff. ===\nLiked: The room was exceptional! Just what I'd requested: very quiet, at the top and back of the hotel. It was super clean, beautifully furnished and really comfortable. The reception, bar and restaurant were also first class as were the friendly, helpful and efficient staff. Thank you so much.\nDisliked: The lack of an on site car park was a hassle with unloading and loading luggage, especially clothes on hangers, bags and golf items.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-24",
    "reviewer_name": "Julian",
    "star_rating": 4.5,
    "review_text": "Liked: Lovely hotel in great location\nDisliked: Service a bit slow for bar and breakfast but staff lovely",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-24",
    "reviewer_name": "Sammi",
    "star_rating": 4.0,
    "review_text": "=== Lovely hotel and comfortable stay ===\nLiked: The hotel is very stylish and a lot of thought has obviously gone into the design. The room was comfortable. It’s in a great location - right on the high street amongst everything.\nDisliked: It was very noisy until about 11pm, the room was right above the restaurant and the sound travelled quite a bit. If you’re taking a dog you can only stay in the terrace rooms - the listing on booking.com doesn’t specify, so allowed us to book a non dog friendly room (even though I selected bringing a pet). It was only when I asked the hotel about the dog charge that they told me our room wasn’t suitable - we could’ve just turned up and been stuck! This isn’t necessarily a hotel issue (more booking.com) but a big flaw when trying to book. The hotel also told me they couldn’t do anything about it even though I’m fairly sure they can reject a booking so I could’ve booked the correct room… anyway we ended up not taking the dog! Caused a bit of stress ahead of our trip.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-21",
    "reviewer_name": "Kathryn",
    "star_rating": 5.0,
    "review_text": "=== We stayed for 5 nights and had a wonderful time ===\nLiked: All the staff were so friendly, the room was brilliant and the breakfasts were exceptional\nDisliked: Drinks were a little pricey in the bar",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-20",
    "reviewer_name": "Karen",
    "star_rating": 5.0,
    "review_text": "=== Excellent location. Well maintained property. Super staff ===\nLiked: Great central location. Super staff",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-14",
    "reviewer_name": "Barbara",
    "star_rating": 5.0,
    "review_text": "=== Absolutely fabulous stay in every way ===\nLiked: Everything, very comfortable, great staff and lovely food\nDisliked: Nothing to dislike",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-14",
    "reviewer_name": "John",
    "star_rating": 5.0,
    "review_text": "=== Superb staff , wonderful food and lovely design  . Everything perfect ===\nLiked: The location was perfect for both visiting the town and as a base for touring. The decor is wonderful and the rooms are delight . Simply put Perfection .\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-11",
    "reviewer_name": "Amanda",
    "star_rating": 5.0,
    "review_text": "Liked: A lovely relaxing and comfortable place to stay.\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-02",
    "reviewer_name": "Clifford",
    "star_rating": 4.5,
    "review_text": "=== Great place for a visit to Lymington and surrounding area. ===\nLiked: Location is great, hotel staff really helpful and friendly. Dined in the restaurant for dinner and lunch and impressive gluten free options.\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-02",
    "reviewer_name": "David",
    "star_rating": 0.5,
    "review_text": "Liked: The Hitel cancelled our booking an hour before arrival. They said they’d messed up. That didn’t stop You guys at Booking.com from taking all the money though. I want my money back!!!",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-01",
    "reviewer_name": "David",
    "star_rating": 4.5,
    "review_text": "=== Short stay at Stanwell House ===\nLiked: We loved the location, rooms were very comfortable and well appointed. The restuarent was beautiful, food great and staff exceptional. Overall the hotel was a delight and ideally placed to explore Lymington.\nDisliked: Finding the carpark was a little tricky and when we did there was no space available and we had to park in the long stay with the associated lack of security. This was explained at point of booking and expected but dissapointing nonetheless.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-29",
    "reviewer_name": "Tim",
    "star_rating": 4.5,
    "review_text": "Liked: Comfortable, well presented rooms\nDisliked: Lack of car parking space",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-23",
    "reviewer_name": "James",
    "star_rating": 4.5,
    "review_text": "=== Excellent hotel, great facilities and location. Just need aircon in the rooms please ===\nLiked: Amazing staff and great location in town.\nDisliked: Our room didn’t have any air conditioning or fans available, and even though it wasn’t a particularly warm day outside, the rooms were very warm to try to sleep in",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-23",
    "reviewer_name": "Philip",
    "star_rating": 4.0,
    "review_text": "=== A perfect place to stay for the town and surrounding tourist destinations ===\nLiked: Great location in the town . The staff were very pleasant and helpful. Clean and well equipped rooms",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-11",
    "reviewer_name": "Edith",
    "star_rating": 5.0,
    "review_text": "=== Enjoyed interacting with the staff. ===\nLiked: Location, friendly staff\nDisliked: I am 76 years old and have arthritis in my legs. I found the stairs difficult. However the staff was very helpful in offering assistance with my luggage.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-08",
    "reviewer_name": "Karin",
    "star_rating": 5.0,
    "review_text": "=== Would highly recommend and hope to visit again ===\nLiked: Nicely appointed, excellent  location, friendly staff and great breakfast\nDisliked: Slightly clearer instructions to their parking might have been helpful , but that’s all o can think of",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-01",
    "reviewer_name": "Katie",
    "star_rating": 5.0,
    "review_text": "=== The staff where exceptional ===\nLiked: Was very clean and the staff really helpful and friendly",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-28",
    "reviewer_name": "Mary",
    "star_rating": 4.0,
    "review_text": "=== Lovely break great location ===\nLiked: Good location good facilities\nDisliked: Little bit noisy as our room was facing the main road",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-26",
    "reviewer_name": "Jill",
    "star_rating": 5.0,
    "review_text": "=== Very pleasant stay in your lovely hotel ===\nLiked: Decor\nRoom 17",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-25",
    "reviewer_name": "Nicole",
    "star_rating": 5.0,
    "review_text": "=== Fabulous few days ===\nLiked: Good location. Friendly staff  & immaculately presented.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-25",
    "reviewer_name": "Kirk",
    "star_rating": 5.0,
    "review_text": "=== Hotel, staff, food and drink all excellent. ===\nLiked: Super stylish boutique hotel\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-21",
    "reviewer_name": "Christina",
    "star_rating": 5.0,
    "review_text": "=== We had a lovely overnight stay, we had evening arrangements but enjoyed a drink in the bar and would definitely go back ===\nLiked: Beautiful building and decor. Lovely bar and restaurant and outside space. Fabulous bedroom too.\nDisliked: N/A",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-19",
    "reviewer_name": "Chelsea",
    "star_rating": 3.5,
    "review_text": "Liked: Location, decor, breakfast\nDisliked: Room was very small for the price",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-16",
    "reviewer_name": "Alastair",
    "star_rating": 4.5,
    "review_text": "=== Beautiful hotel, lovely location, great for a family get together ===\nLiked: Comfortable, clean, beautifully decorated, fabulous and friendly staff\nDisliked: Would have loved access to some fitness facilities",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-15",
    "reviewer_name": "Douglas",
    "star_rating": 5.0,
    "review_text": "=== Excellent hotel with great staff in perfect location ===\nLiked: Great service from all staff",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-15",
    "reviewer_name": "Keith",
    "star_rating": 5.0,
    "review_text": "=== Beautifully decorated boutique hotel with excellent food, nice bar, Orangary for breakfast and very friendly staff. ===\nLiked: Location, decor & facilities were all great.\nDisliked: Shower plug was a little blocked- nor sorted during our stay, but wasn’t a major issue…",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-11",
    "reviewer_name": "Dale",
    "star_rating": 5.0,
    "review_text": "=== Amazing stay, can’t wait to return! ===\nLiked: What a beautiful hotel in an excellent location. Room was gorgeous and all staff were really friendly. Breakfast was genuinely the best breakfast we’ve both ever had.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-11",
    "reviewer_name": "Richard",
    "star_rating": 5.0,
    "review_text": "Liked: Ambience, location, helpful and friendly staff and great food and drink.\nDisliked: Nothing comes to mind.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-08",
    "reviewer_name": "Chloe",
    "star_rating": 4.5,
    "review_text": "=== Wonderful hotel to stay at in the heart of Lymington ===\nLiked: Great location, fab decor, and lovely staff",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-06",
    "reviewer_name": "Julie",
    "star_rating": 4.5,
    "review_text": "=== Lovely staff, beautiful hotel. Great cocktails! ===\nLiked: Quirky!  Beautiful",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-03",
    "reviewer_name": "Shân",
    "star_rating": 4.5,
    "review_text": "=== Wonderful hotel with excellent service ===\nLiked: The staff were very smiley, friendly and helpful. The decor is beautiful and the bed was very comfortable. Breakfast was delicious with options for everyone.\nDisliked: The carpark is difficult to find.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-01",
    "reviewer_name": "Amy",
    "star_rating": 5.0,
    "review_text": "=== Gorgeous and well located, superb food! ===\nLiked: Loved our one night stay here. Very well located on the high street with a dedicated parking lot. \nThe decor is beautiful - whoever did the interior has a fantastic eye! The rooms are a good size and have everything you’d need. The staff are very attentive - phoning to check in that\n everything’s okay. I loved the delivery of a newspaper and fresh milk in the morning. We ate at the Sapphire restaurant - lovely ambience and the food was great. My husband loved his lobster macaroni. I really enjoyed my lobster hollandaise but did find that the sauce overpowered the delicate lobster flavour.\nDisliked: Nothing not to like really! The parking lot is small so you might miss out on a spot if you don’t get there early enough.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-28",
    "reviewer_name": "Helen",
    "star_rating": 4.5,
    "review_text": "Liked: The bedrooms were very tastefully furnished. Luxurious bedding.\nDisliked: Nothing. Only the room was very warm overnight.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-26",
    "reviewer_name": "Emma",
    "star_rating": 4.0,
    "review_text": "=== Lovely comfortable hotel in a beautiful location ===\nLiked: Lovely comfortable room, comfortable bed, nice bathroom.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-24",
    "reviewer_name": "Rod",
    "star_rating": 5.0,
    "review_text": "=== Excellent hotel, and definitely one of the best we have stayed in, in the UK ===\nLiked: Excellent facilities. Room was spotless and very comfortable bed. Staff were very attentive\nDisliked: Room was a little warm despite all radiators being off. Was fine once window was open, and luckily no noise from outside",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-22",
    "reviewer_name": "Sharon",
    "star_rating": 5.0,
    "review_text": "=== Lovely stay at Stanwell House ===\nLiked: The room was beautifully decorated and the bathroom stylish and very clean. Breakfast was well presented and was wonderful. The staff were all very helpful and dealt with matters quickly and with a smile.\nDisliked: Nothing!",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-20",
    "reviewer_name": "Poppy",
    "star_rating": 5.0,
    "review_text": "=== Amazing ===\nLiked: It was beautiful, rooms are gorg. The restaurant and bar are lovely too. Bar slightly slow service, but it was very busy\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-18",
    "reviewer_name": "Nicoll",
    "star_rating": 4.5,
    "review_text": "=== A great stay in a lovely old hotel ===\nLiked: Beautiful decor, quality furnishings, great breakfast, friendly helpful staff, ambiance pitched perfectly between smart and informal.\nDisliked: The car park was difficult to find - it is a small car park within the public car park, with only a tiny hard-to-read sign stating it is the hotel car park - with no mention on any of the hotel information that it is on the other side of the main street to the hotel and not beside it. Clearer directions would help.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-18",
    "reviewer_name": "Garth",
    "star_rating": 5.0,
    "review_text": "=== All good, would definitely stay again ===\nLiked: The position was great and the pub and restaurant were popular\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-15",
    "reviewer_name": "Michael",
    "star_rating": 5.0,
    "review_text": "Liked: Lovely location and premises. Suited my needs\nDisliked: Room too hot",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-14",
    "reviewer_name": "Wendy",
    "star_rating": 5.0,
    "review_text": "=== Wonderful Place ===\nLiked: Excellent service from staff, always with a smile. Very comfy bed and pillows. Really enjoyed the breakfast choice and food in the restaurant.\nDisliked: Sadly didn't have time to try the bar.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-26",
    "reviewer_name": "Guy",
    "star_rating": 4.5,
    "review_text": "Liked: Really delicious food - try the salt and pepper squid with black garlic mayo!",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-25",
    "reviewer_name": "David",
    "star_rating": 4.0,
    "review_text": "=== Comfortable and we would return ===\nLiked: Felt more like a bedroom at home rather than a hotel! Just lovely.\nDisliked: Not the fault of the hotel but smoke alarms went off at 11.30pm when we were asleep! Someone smoking in tbeir room! Also wall are quite thin and we could hear televisions next door. Doors to rooms don’t close quietly so it was noisy from that point of view",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-23",
    "reviewer_name": "Daniel",
    "star_rating": 5.0,
    "review_text": "Liked: Everything was excellent, I thought the staff were amazing in particular Maria at reception was very helpful and Spencer in the Restaurant was brillient. We also thought the room and the food was excellent.\nDisliked: A more varied wine list would have been good but the selection was still good",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-19",
    "reviewer_name": "Steve",
    "star_rating": 3.5,
    "review_text": "=== Good but not great ===\nLiked: Stanwell is a very friendly clean and comfortable hotel in the classical tradition . It has a well stocked bar that  gets very busy at 6 pm for pre dinner drinks  .Staff were well turned out in uniforms .Fresh milk was provided outside our door in the morning .Our room overlooked the main street which was busy on the Saturday with a market but quiet when we retired to bed .We had an issue in the restaurant (see below )  which was dealt with by the manager swiftly and with courtesy\nDisliked: When a hotel charges a premium rate you expect attention to detail .We were told that the restaurant was fully booked and we were offered the orangery In fact the orangery was probably a better option although we saw tables in the restaurant that were unused . The menus were exactly the same so no problem .However we returned our fish that was either not fully cooked or was not fresh .It was tough /stringy rather than flakey  .This was returned but this time the new potatoes and carrots were not fully cooked . One of our deserts was also returned . The word is that a new chef is starting and will bring out a new menu . Staff are rushed off their feet as the new forest has difficulty attracting hospitality labour especially post brexit .",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-19",
    "reviewer_name": "Jacob",
    "star_rating": 4.0,
    "review_text": "Liked: Food was great\r\nFriendly staff \r\nGreat location\nDisliked: No AC or Fridge in room",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-17",
    "reviewer_name": "Paul",
    "star_rating": 5.0,
    "review_text": "=== An ideal location for a couple of days in Lymington and the New Forest. ===\nLiked: Lovely rooms, great bathrooms, friendly staff, buzzing bar and good breakfast.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-15",
    "reviewer_name": "Charlotte",
    "star_rating": 4.5,
    "review_text": "=== It was a lovely night away ===\nLiked: The hotel was lovely as was the staff and food we were made very welcome.\r\nThe room was clean and very comfortable\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-11",
    "reviewer_name": "Carla",
    "star_rating": 5.0,
    "review_text": "=== Incredible hotel, excellent service ===\nLiked: Location right on high street, the small touch of a personalise card for my partner, and the breakfast was delicious. Really professional staff, very pleased with service. \nThe roll too bath was gorgeous",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-29",
    "reviewer_name": "Iain",
    "star_rating": 4.5,
    "review_text": "=== Lovely hotel with friendly staff ===\nLiked: Everything had been thought of a very spacious room\nDisliked: A very firm bed",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-22",
    "reviewer_name": "Kerrie",
    "star_rating": 4.5,
    "review_text": "=== Friendly service, lovely hotel. Evening meal in the restaurant also wonderful ===\nLiked: Great location and the rooms were beautiful\nDisliked: Lots of stairs, although the view from the room was worth it",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-21",
    "reviewer_name": "Katie-sarah",
    "star_rating": 4.0,
    "review_text": "=== Lovely stay ===\nLiked: Lovely location right in the centre of Lymington. Hotel was lovely and the room bright and comfortable",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-18",
    "reviewer_name": "David",
    "star_rating": 4.5,
    "review_text": "=== Excellent, lovely staff made our stay  a super one ===\nLiked: We were upgraded to a beautiful room. The staff were lovely. The room infact the whole hotel was comfortably warm when it was freezing outside. I would definitely recommend this hotel  even though its a tad expensive I think it is worth it.\nDisliked: My only gripe is the tea and coffee facilities were not replaced.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-17",
    "reviewer_name": "Roger",
    "star_rating": 4.5,
    "review_text": "Liked: Lovely hotel and comfortable room. Parking, although across the road , was easy. Welcoming and helpful staff.\nDisliked: We thought the food was good but a little expensive.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-14",
    "reviewer_name": "Ian",
    "star_rating": 4.0,
    "review_text": "Liked: The hotel had a lovely had lovely, welcoming feel to it. Our room was cosy.\nDisliked: The bathroom floor appeared grubby.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-13",
    "reviewer_name": "Lisa",
    "star_rating": 5.0,
    "review_text": "=== The staff went above and beyond. The room was stunning and really comfortable bed with a view ===\nLiked: Beautifully furnished and ideally situated in town. The staff were superb and the food delicious.\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-11",
    "reviewer_name": "Emily",
    "star_rating": 4.5,
    "review_text": "=== Fantastic stay at Stanwell House, we are ere only there for 1 night, but would definitely return for a longer stay. ===\nLiked: Friendly staff, easy check in, beautiful interiors\nDisliked: Parking not guaranteed, very hot rooms!",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-06",
    "reviewer_name": "Victoria",
    "star_rating": 4.5,
    "review_text": "=== Lovely very dog friendly stay ===\nLiked: Very dog friendly, lovely breakfast, fluffy towels attentive reception staff, beautiful decoration, lovely toiletries, fresh milk, nice biscuits, water etc maybe could add robes or slippers in future as the room had a tiled floor. Would definitely stay again.\nDisliked: I do think the dog charge is high compared to other similar establishments who charge less and sometimes provide more.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-01",
    "reviewer_name": "Wendy",
    "star_rating": 5.0,
    "review_text": "=== Excellent stay to celebrate our anniversary. ===\nLiked: Superb location, excellent decor throughout, fantastic breakfast.\nDisliked: Not enough car parking but long stay was in the same location for £5 for 20 hours.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-28",
    "reviewer_name": "Helen",
    "star_rating": 4.5,
    "review_text": "=== A smart boutique hotel with great staff. ===\nLiked: Great location on the Main Street in Lymington. Lovely hotel with great dining facilities. Nice bar area.\nDisliked: N/a",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-19",
    "reviewer_name": "Alison",
    "star_rating": 4.0,
    "review_text": "=== Beautifully decorated and great location ===\nLiked: Lovely room with really nice toiletries supplied. Comfy bed. We were over looking the high street no issues with noise. Salt bar was a lovely area, cocktails were great.\nDisliked: Parking is an issue and would have liked more vegetarian options for breakfast as I don’t eat eggs either. Breakfast was not included in room rate.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-13",
    "reviewer_name": "Deborah",
    "star_rating": 3.5,
    "review_text": "Liked: Situation on the High Street & quality of food especially the evening meal and superb breakfast\nDisliked: Thin walls between rooms",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-07",
    "reviewer_name": "Jordan",
    "star_rating": 4.5,
    "review_text": "=== Lovely, highly recommend ===\nLiked: Absolutely stunning property. The rooms were lovely and the decor throughout was lovely. Bar and restaurant staff were very nice. Hotel was also very clean!\nDisliked: It is a bit noisey, our room was above the bar so was noisey through out the day and late evening, however not a problem for us but something to consider if a light sleeper/using the room in the day!",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-06",
    "reviewer_name": "Ccsims",
    "star_rating": 4.0,
    "review_text": "=== Nice stay, great location and good rooms. ===\nLiked: Lovely room and general hotel ambience across all main spaces. Nice staff and good breakfast. Great location in the middle of town so easy to explore town.\nDisliked: Dog policy wasn't super clear on the site, and dogs weren't allowed to be left in rooms which should be shown on the site before booking. Some areas were dog friendly but this is always awkward when new policies are shown on arrival. Parking wasn't that easy, used the long stay carpark but carrying luggage not easy across main road. Should be advertised with no parking as not guaranteed.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-04",
    "reviewer_name": "Jodie",
    "star_rating": 5.0,
    "review_text": "=== Amazing. Beautiful place ===\nLiked: Everything!! A wonderful beautiful place, lovely food and drinks. Friendly staff.\nDisliked: Nothing. It's the best place I've ever been to.\nReally comfortable and spacious room. Lovely breakfast.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-03",
    "reviewer_name": "Donna",
    "star_rating": 5.0,
    "review_text": "=== Stanwell House Hotel 10/10 ===\nLiked: Everything the staff were outstanding 👏 the facilities were excellent and the cocktails 🍸 were sublime. Highly recommended 👌 👍 👏\nDisliked: Nothing it was perfect",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-01",
    "reviewer_name": "Jan",
    "star_rating": 4.5,
    "review_text": "=== Fantastic ===\nLiked: Everything and the location\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-20",
    "reviewer_name": "Jennifer",
    "star_rating": 5.0,
    "review_text": "=== Excellent restful break ===\nLiked: Clean comfortable and friendly",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-19",
    "reviewer_name": "Chantaye",
    "star_rating": 5.0,
    "review_text": "=== Fabulous ===\nLiked: Such a beautiful little hotel.fully recommend a stay here",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-17",
    "reviewer_name": "Helen",
    "star_rating": 5.0,
    "review_text": "=== Lovely and relaxing will definitely come back again ===\nLiked: Friendly clean comfortable food good",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-15",
    "reviewer_name": "Jennifer",
    "star_rating": 5.0,
    "review_text": "=== we had such a relaxing peaceful stay with staff who were super polite and friendly ===\nLiked: beautiful room, lovely dinning room, exceptional staff\nDisliked: our room faced onto high st which was abit noisey",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-13",
    "reviewer_name": "Darren",
    "star_rating": 4.0,
    "review_text": "=== Very nice hotel with lovely food & drinks . Will definitely return if in the area. ===\nLiked: Lovely town centre hotel, beautifully decorated , with well trained attentive staff.\nDisliked: Parking was a bit difficult to find at night.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-08",
    "reviewer_name": "Marmari",
    "star_rating": 5.0,
    "review_text": "Liked: Excellent!. Pleasant and friendly staff. \nThe room was very clean and spacious with a super comfortable bed. White fluffy towels and high-quality toiletries in the bathroom. Fresh milk in the morning by the door was a lovely touch. Breakfast was scrumptious. Really enjoyed our stay and would most certainly recommend it.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-06",
    "reviewer_name": "Leanne",
    "star_rating": 4.5,
    "review_text": "=== Beautiful hotel with great attention to detail in all aspects. ===\nLiked: The decor, room etc. Staff also great!\nDisliked: The decor, food, room was lovely",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-05",
    "reviewer_name": "Robin",
    "star_rating": 5.0,
    "review_text": "=== A lovely, relaxing and luxurious stay ===\nLiked: Loved the decor in the rooms, the bar and the restaurant\nDisliked: Nothing. It was all amazing. The only thing I would have changed would be to have a bath in our bathroom",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-30",
    "reviewer_name": "Warner",
    "star_rating": 5.0,
    "review_text": "=== Lovely stay ===\nLiked: Lovely staff and beautiful surroundings\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-29",
    "reviewer_name": "Andrew",
    "star_rating": 4.5,
    "review_text": "=== Maria on reception was excellent ===\nLiked: Very nice stay",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-29",
    "reviewer_name": "Chris",
    "star_rating": 5.0,
    "review_text": "=== A wonderful stay and the perfect seaside getaway. ===\nLiked: I loved the decor, the interior has been done very well and you felt instantly at home. The breakfast and food in general was brilliant\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-29",
    "reviewer_name": "Zoe",
    "star_rating": 4.5,
    "review_text": "=== Great French fries in the restaurant ===\nLiked: Very clean \nOld fashioned, historic feeling building renovated for comfort\nDisliked: I loved it all— would be a challenge for those with mobility issues up the stairs",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-28",
    "reviewer_name": "Caroline",
    "star_rating": 5.0,
    "review_text": "=== Beautiful decor, great food and a cosy bar..above all the staff were excellent. ===\nLiked: Decor, food, bar and staff all wonderful.\nDisliked: N/A",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-21",
    "reviewer_name": "Karen",
    "star_rating": 2.5,
    "review_text": "=== It tarred our stay unfortunately. Although the place was stunning ===\nLiked: Beautiful property! Design was amazing\nDisliked: The bed was comfortable however we couldn't sleep because each time we moved the bed creaked loudly with the slightest movement. And my husband ended up with a bad shoulder",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-21",
    "reviewer_name": "Ian",
    "star_rating": 5.0,
    "review_text": "Liked: Great stay at Stanwell House - very pleasant staff and exceptional food! I had the lobster linguine which was delicious! The room (as always) was very clean and set for a restful nights sleep.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-20",
    "reviewer_name": "John",
    "star_rating": 5.0,
    "review_text": "=== Fantastic hotel with lovely helpful staff, will be back very soon. ===\nLiked: Lovely Staff , beautiful hotel and rooms. Delicious breakfast",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-20",
    "reviewer_name": "Mark",
    "star_rating": 5.0,
    "review_text": "=== Really lovely two day break with great food ===\nLiked: Very comfortable food was lovely staff friendly great location\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-19",
    "reviewer_name": "Konstantin",
    "star_rating": 0.5,
    "review_text": "Disliked: Bed was extremely noisy and we had the worst night sleep ever. \r\nManager was apologetic when I explained that in the morning, but offered absolutely no redress.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-16",
    "reviewer_name": "Nicky",
    "star_rating": 4.0,
    "review_text": "=== Mostly nice - probably eat somewhere else. ===\nLiked: Beautiful old but refurbed property.\nDisliked: The restaurant",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-13",
    "reviewer_name": "Matthew",
    "star_rating": 5.0,
    "review_text": "=== great staff, amazing decor and superb food ===\nLiked: it was just what we hoped for\nDisliked: we had to leave",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-13",
    "reviewer_name": "Emma",
    "star_rating": 4.5,
    "review_text": "=== A beautiful hotel in a great location with really friendly and attentive staff ===\nLiked: Beautiful room, fantastic location, great food and really wonderful service. We were really impressed with Stanwell House, definitely recommend it and would love to stay again.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-12",
    "reviewer_name": "John",
    "star_rating": 5.0,
    "review_text": "=== Classy hotel, helpful and friendly staff, lovely rooms, great central location and good breakfast. ===\nLiked: First impression was good - the hotel looked very well maintained and upmarket. Staff were friendly and very helpful. Rooms were lovely and breakfast very good.\nDisliked: No aircon or fan, room was at the front of the hotel on the road. Had to sleep with the window open because of the (unexpected!) hot weather in October - and was woken a few times by traffic. Cannot really be helped and only a small thing. Did not detract from a good stay.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-11",
    "reviewer_name": "Christine",
    "star_rating": 4.0,
    "review_text": "=== Overall most enjoyable. ===\nLiked: Lovely room, great breakfast and location.\nDisliked: Bedroom window over looking garden with people sitting underneath window and eating at tables at all times.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-11",
    "reviewer_name": "Douglas",
    "star_rating": 5.0,
    "review_text": "=== Excellent hotel, with staff who were well trained in making our stay special. ===\nLiked: Comfortable. A lot of trouble had gone into furnishings, in a style in keeping with the building.\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-09",
    "reviewer_name": "Sue",
    "star_rating": 5.0,
    "review_text": "=== Excellent ===\nLiked: Fabulous room & friendly staff",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-08",
    "reviewer_name": "Emma",
    "star_rating": 5.0,
    "review_text": "Liked: Friendly welcome and helpful when we made a mistake booking without the dog.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-06",
    "reviewer_name": "Steve",
    "star_rating": 3.0,
    "review_text": "=== Pleasant but would not stay again. ===\nLiked: Centrality for what we needed.\nDisliked: Pokey small rooms and stairs everywhere, difficult with mobility issues which we were not warned about before or after booking. Breakfast on our last morning was spoiled because it was slow and the order was not put in properly by a staff member!",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-05",
    "reviewer_name": "Rachel",
    "star_rating": 5.0,
    "review_text": "=== Amazing ===\nLiked: Absolutely perfect! Lovely rooms, beautiful hotel, good food and wine, perfect staff. I cannot fault anything. Will be back.\nDisliked: Very well put together hotel. The attention to detail was top class.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-02",
    "reviewer_name": "Andrew",
    "star_rating": 4.0,
    "review_text": "=== Beautiful boutique stay ===\nLiked: Chic interiors made the Stanwell feel like home\nDisliked: The room was very hot even with the windows open",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-02",
    "reviewer_name": "Elissa",
    "star_rating": 4.0,
    "review_text": "=== Would definitely stay again ===\nLiked: Lovely busy friendly hotel in a good central location. Beautifully decorated, comfortable room....\nDisliked: Poor water pressure in shower",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-30",
    "reviewer_name": "Sally",
    "star_rating": 4.5,
    "review_text": "=== Comfortable, stylish hotel minutes from the beautiful Quayside ===\nLiked: Superb location on the High Street and minutes walk from the Quay. Very comfortable and stylish room. A fresh and clean feel throughout the hotel. Excellent, attentive and welcoming staff.\nDisliked: The cost for one night was almost prohibitive. Would’ve liked some vegan/plant based options for breakfast. We had to go elsewhere. Bathroom was a little on the small side although very nicely done out",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-28",
    "reviewer_name": "Colin",
    "star_rating": 4.5,
    "review_text": "=== Excellent hotel in a great location, couldn’t ask for more! ===\nLiked: Recently renovated it was clean, classy and relaxing.\nDisliked: She’ll in the lobster macaroni and my wife had the same gluten free dish both nights but on the second occasion it was dry and not as good.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-25",
    "reviewer_name": "Jonathan",
    "star_rating": 5.0,
    "review_text": "=== Very enjoyable and would definitely revisit ===\nLiked: Clean and friendly/helpful staff - very welcoming\nDisliked: Nothing at all",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-24",
    "reviewer_name": "Sharon",
    "star_rating": 5.0,
    "review_text": "=== Excellent stay would definitely return again when in the area ===\nLiked: Lovely Restaurant and Bar and in the town centre. Room was small but had everything you needed and the bed was really comfortable and the bathroom was spacious with a walk in shower\nDisliked: Not a lot of parking spaces but we managed to get one.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-23",
    "reviewer_name": "Matt",
    "star_rating": 5.0,
    "review_text": "=== Very enjoyable experience ===\nLiked: Bar staff very friendly\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-20",
    "reviewer_name": "Claire",
    "star_rating": 5.0,
    "review_text": "=== Lovely, wish it could have been longer. ===\nLiked: Room was beautiful and breakfast was Lovely. No air con which wasn't a problem for us. It has been recently refurbished and they have done a great job - lovely attention to detail. A nice touch was the radio playing in the room when we arrived.\r\nNice bar!\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-18",
    "reviewer_name": "H",
    "star_rating": 4.5,
    "review_text": "=== Two nights of luxury, can’t wait to get back. ===\nLiked: Room was large and very comfortable and overlooking the garden.\nDisliked: A minor issue but a magnifying mirror would be so appreciated by ladies -  for ease of applying makeup .",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-17",
    "reviewer_name": "Adam",
    "star_rating": 3.0,
    "review_text": "Liked: the view from my room\nDisliked: for the amount being charged for the room there should also be some additional facilities like gym or pool",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-14",
    "reviewer_name": "Vanessa",
    "star_rating": 4.0,
    "review_text": "=== Overall very good ===\nLiked: Dinner\nDisliked: Breakfast too expensive",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-13",
    "reviewer_name": "Robert",
    "star_rating": 4.0,
    "review_text": "Liked: Location and vibe were great, only disappointing thing was that we’d booked 2 rooms and we were allocated on loft room which had very restricted height. Felt that room should be cheaper than the other",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-03",
    "reviewer_name": "Kevin",
    "star_rating": 4.5,
    "review_text": "=== Nice. ===\nLiked: Restaurant, bar and vibe\nDisliked: Had glass inside wine bottle. Hugh key tag it’s ruining room doors.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-01",
    "reviewer_name": "Sharon",
    "star_rating": 5.0,
    "review_text": "=== Fantastic find ===\nLiked: Amazing luxury Hotel . Great value for money . Staff amazing and the food was great. Rooms very exceptional",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-31",
    "reviewer_name": "Alfred",
    "star_rating": 4.0,
    "review_text": "Liked: The hotel and room were clean and had all expected amenities. The location was good. The restaurant food was good for both dinner and breakfast. The breakfast staff were fast, efficient, and friendly. The breakfast space had enough space, and there's a patio nearby where you can also choose to sit.\nDisliked: Getting to the second-floor room with large bags was  a bit cumbersome because of the narrow stairwell and hallway. It's manageable, though. The room was a bit on the small side too, which made it a bit hard to navigate with big suitcases filling up the space. The lock to the room was difficult to use to get into the room. Parking was hard to find upon arrival. We had to park in short-term parking across the street (once we found it). Once we did, we asked at the front desk, and they directed us to their parking lot, which was nearby, across the street. The parking was easy enough to use (once we knew where it was), but the spots can fill up fast, so there's a chance you might not get a spot there. However, if that happens, you can still pay for parking in the long-term public parking lot that adjoins the hotel's parking lot.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-31",
    "reviewer_name": "Tara",
    "star_rating": 3.5,
    "review_text": "Liked: Lovely decor\nDisliked: TV didn’t work for the entire stay and toilet was dirty when we arrived.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-29",
    "reviewer_name": "Kevin",
    "star_rating": 4.5,
    "review_text": "=== It was a fabulous night away ===\nLiked: The location is excellent and service was brilliant\nDisliked: The parking was a little difficult to find but just on the other side of the high street so very close.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-29",
    "reviewer_name": "Tony",
    "star_rating": 3.5,
    "review_text": "=== Nice place, poor price ===\nLiked: nice property. staff very helpful\nDisliked: We should have checked for a price with the hotel instead of blindly booking with Booking.com. I found out that the three day break would have been £90 cheaper and would have included breakfast (£15.95 pp per day) if we had booked directly. I was seduced by my 'Genius discount' I'm afraid. I will always check with the property from now on.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-29",
    "reviewer_name": "Andrew",
    "star_rating": 4.5,
    "review_text": "=== Relaxing & comfortable stay ===\nLiked: Great Location , Very Attractive Hotel with cool vibe & clean comfortable Rooms. Very Good staff .\nDisliked: I didn’t particularly enjoy the Food Menu",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-27",
    "reviewer_name": "Lenny-dvx",
    "star_rating": 5.0,
    "review_text": "Liked: We had an amazing stay at Stanwell House. The quality of the room, the service, the bar and restaurant was just perfect.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-23",
    "reviewer_name": "Peter",
    "star_rating": 5.0,
    "review_text": "=== A shame we couldn’t have stayed longer ===\nLiked: Great location and lovely outside dining \nExceptional staff",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-23",
    "reviewer_name": "Caroline",
    "star_rating": 5.0,
    "review_text": "Liked: Beautiful hotel with a great restaurant and garden/terraces.\nDisliked: No complaints.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-22",
    "reviewer_name": "Louise",
    "star_rating": 5.0,
    "review_text": "=== Elegant, luxuriously wonderful stay ===\nLiked: Very luxurious, beautifully decorated and clean. Just perfect for our stay.\nDisliked: My other half loved the staircase and railings. Being a welder he was in awe! We loved the room as it was fresh, clean, elegant and beautifully decorated.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-21",
    "reviewer_name": "Pedro",
    "star_rating": 2.5,
    "review_text": "Disliked: too hot - no air conditioning",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-19",
    "reviewer_name": "Paul",
    "star_rating": 4.0,
    "review_text": "=== nice break visiting for a birthday would recommend ===\nLiked: very clean , location excellent good staff\nDisliked: car parking",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-18",
    "reviewer_name": "Richard",
    "star_rating": 4.5,
    "review_text": "=== A nice place in a great location ===\nLiked: Great location, very neat and tidy and excellent decor.  High level of attention to detail in the room and really pleasant and responsive staff.  A really nice feeling about the place, it's very individual and we had a nice relaxing stay.\nDisliked: The room was quite hot, but a fan was supplied on request.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-15",
    "reviewer_name": "Lynn",
    "star_rating": 5.0,
    "review_text": "Liked: Told you enough already",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-02",
    "reviewer_name": "Bernadette",
    "star_rating": 3.5,
    "review_text": "=== Enjoyable ===\nLiked: Location\nDisliked: Room was too hot",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-20",
    "reviewer_name": "Vp",
    "star_rating": 1.5,
    "review_text": "=== 4 star Hotel 2 star service at best!!! ===\nLiked: Hotel is beautiful but staff and expectations not up to standard at all\nDisliked: Staff were 2 star at best ..rude, ignorant and unhelpful certainly don't go the extra mile  and after I told reception about the problems we incurred of which were several they said they would pass it on to the manager who has yet to date not rang me to apologise after spending what I did I would at least expect a courtesy call to apologise for the failings of the hotel.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-19",
    "reviewer_name": "Sean",
    "star_rating": 5.0,
    "review_text": "=== Will recommend hotel and restaurant to friends ===\nLiked: Very friendly, efficient staff.\nDisliked: No complaints",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-17",
    "reviewer_name": "Stewart",
    "star_rating": 4.5,
    "review_text": "Liked: Sericw from fron of house staff was excellent. However the tome it took ti gwt food after it was ordered did take some time, i suspect though thats because everything was cooked fresh.\nDisliked: Trying to get  a table in the bar to have a drink was virtualy impossible but there was room in the Orangery.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-12",
    "reviewer_name": "Ian",
    "star_rating": 3.5,
    "review_text": "=== My last stay was far better. The service didn’t seem as strong as before - the bar staff were all socialising with each ===\nLiked: Clean and great location for my work visit\nDisliked: I ordered the Southern Fried Chicken Burger in the bar - it was so over seasoned, it made me feel quite unwell. Too much salt and I think rosemary or thyme….it was just too rich. I unfortunately spent most of my night on the loo after dinner!",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-10",
    "reviewer_name": "Ian",
    "star_rating": 5.0,
    "review_text": "=== We enjoyed our stay but disappointed that breakfast wasn’t included for the Sunday as we thought breakfast was included ===\nLiked: Good location, staff very helpful and friendly",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-07",
    "reviewer_name": "Nick",
    "star_rating": 5.0,
    "review_text": "=== Fantastic hotel in the middle of Lymington ===\nLiked: We stayed here a few years ago and it was great. Now even better with beautiful refurbished decor, lovely bedrooms and super choice of areas to eat. Food was delicious and the staff were all friendly, helpful and efficient.\nDisliked: Garden area is still in preparation, but will obviously be great when it’s finished.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-26",
    "reviewer_name": "Emma",
    "star_rating": 4.5,
    "review_text": "=== Wonderful hotel in a wonderful location. ===\nLiked: Wonderful hotel in a wonderful location. Clean, beautiful decor, beautiful views, friendly staff, lovely outside garden for drinks, afternoon tea.\nDisliked: We needed a fan to cool the room down as it was very warm and we had a small room. . I called reception and they found one for us - brilliant!",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-25",
    "reviewer_name": "Paul",
    "star_rating": 5.0,
    "review_text": "=== Lovely ===\nLiked: Beautiful decor, relaxed atmosphere and amazing staff.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-24",
    "reviewer_name": "Marie",
    "star_rating": 5.0,
    "review_text": "Liked: Great staff and location, rooms were tastefully decorated and comfortable",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-21",
    "reviewer_name": "Tina",
    "star_rating": 5.0,
    "review_text": "=== fabulous ===\nLiked: Beautiful location, best room absolutely stunning\nDisliked: everything was exceptional",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-19",
    "reviewer_name": "Karen",
    "star_rating": 5.0,
    "review_text": "=== so cozy and friendly . excellent staff ===\nLiked: decor great\nDisliked: in town center . free parking",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-19",
    "reviewer_name": "John",
    "star_rating": 5.0,
    "review_text": "=== wonderful location and great staff ===\nLiked: great location and set out brilliant",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-13",
    "reviewer_name": "Ann",
    "star_rating": 5.0,
    "review_text": "Liked: The welcome , the very friendly and helpful staff and the gorgeous building.\nDisliked: There wasn't anything we didn't like but thought a small fridge in the room would be really helpful and perhaps breakfast included in the price would have been a lovely touch too.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-12",
    "reviewer_name": "Robinson",
    "star_rating": 3.5,
    "review_text": "=== Ok apart from too small a room..we kept hitting our head on the ceing ===\nDisliked: Room was too small for 2 adlults",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-04",
    "reviewer_name": "Stuart",
    "star_rating": 5.0,
    "review_text": "Liked: excellent hotel and location",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-05-30",
    "reviewer_name": "Nigel",
    "star_rating": 4.0,
    "review_text": "=== made by the location. Clean. Flower pattern a little overpowering. Friendly staff although a little disconnected at time ===\nLiked: friendly courteous staff.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-05-30",
    "reviewer_name": "Natalie",
    "star_rating": 5.0,
    "review_text": "Liked: beautiful decor and garden\nbed very comfortable \nlovely staff\ncentral\nDisliked: parking bit confusing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-05-25",
    "reviewer_name": "Garius",
    "star_rating": 5.0,
    "review_text": "=== Brilliant time in Lymington ===\nLiked: Room great, breakfast & lunch great & location brilliant\nDisliked: Parking - a bit of a pain until you find the car park nearby",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-04-19",
    "reviewer_name": "Jill",
    "star_rating": 5.0,
    "review_text": "=== Amazing ===\nLiked: Amazing\nDisliked: Nothing",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-04-13",
    "reviewer_name": "Katrina",
    "star_rating": 5.0,
    "review_text": "=== Would not hesitate to book again ===\nLiked: The location was great right in the middle of the high street. Room was clean and decorated lovely. Breakfast was tasty and nice to be able to have dogs in part of the eating area. Would stay again and have already told our friends how lovely it was.\r\nStaff also very friendly, smart and helpful\nDisliked: Breakfast was very slow, but we are on holiday so not really an issue for us",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-04-04",
    "reviewer_name": "Paul",
    "star_rating": 5.0,
    "review_text": "=== lovely location, and nice clean hotel ===\nLiked: all round excellent",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-04-03",
    "reviewer_name": "Christine",
    "star_rating": 4.0,
    "review_text": "Disliked: We should have booked a bigger room as ours was under the Eves on the top floor, but you get what you pay for!",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-04-02",
    "reviewer_name": "Stephen",
    "star_rating": 3.0,
    "review_text": "=== fell short of expectations but has potential ===\nLiked: perfect location in a beautiful Regency building. staff were all professional and friendly.\nDisliked: room was far too small and bathroom even worse. hot water temperature was dangerously high and difficult to control. the venue was a strange mix of local pub, destination tea room and sophisticated restaurant. not quite sure if it’s market.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-03-26",
    "reviewer_name": "Keith",
    "star_rating": 5.0,
    "review_text": "Liked: outstanding strive and hospitality",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-03-23",
    "reviewer_name": "Jill",
    "star_rating": 4.0,
    "review_text": "=== beautiful hotel, would definitely go back ===\nLiked: the hotel has been refurbished beautifully and definitely screams boutique hotel. We ate dinner in the Samphire restaurant and the food was great.\nDisliked: service was a bit slow especially in the restaurant, we had to ask for things like drinks a few times but staff were polite.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-03-14",
    "reviewer_name": "Lisa",
    "star_rating": 4.5,
    "review_text": "Liked: The staff are excellent couldn't do a enough for us &the room was excellent together it made the trip very enjoyable",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-03-01",
    "reviewer_name": "Jane",
    "star_rating": 5.0,
    "review_text": "=== fabulous hotel with super staff. ===\nLiked: absolutely beautifully decorated. very tasteful.\nDisliked: nothing at all.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-02-26",
    "reviewer_name": "Jane",
    "star_rating": 4.0,
    "review_text": "Liked: staff very welcoming and place very comfortable",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-02-23",
    "reviewer_name": "Alison",
    "star_rating": 4.5,
    "review_text": "=== Boutique hotel ===\nLiked: The hotel is immaculate and very tastefully decorated. I enjoyed the thick towels, beautiful bathroom and comfy bed. Good choice of coffees and teas, fresh milk offered.\nDisliked: The directions to the parking need to be better explained. About half an hour and much frustration was spent on trying to find it, even once explained by staff and given their map.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-02-21",
    "reviewer_name": "Deborah",
    "star_rating": 5.0,
    "review_text": "=== perfect hotel for a short break. Ideal location for country walks and amazing restaurants. The hotel bar has a fantastic ===\nLiked: Newly refurbished. fantastic location. great staff\nDisliked: car park very difficult to access",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-31",
    "reviewer_name": "Linda",
    "star_rating": 5.0,
    "review_text": "=== perfect position great staff lively bar and welcoming. ===\nLiked: really lovely hotel beautiful decor so nicely done , staff helpful and always on hand and the new bar and restaurant is outstanding.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-19",
    "reviewer_name": "Jeff",
    "star_rating": 5.0,
    "review_text": "Liked: Everything.... Couldn't fault a thing and most of all the staff were the best I've experienced in this country.\nDisliked: Can't think of anything at all",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-14",
    "reviewer_name": "Pamela",
    "star_rating": 3.5,
    "review_text": "=== will not stay in the same room ===\nLiked: staff\nDisliked: the room had no air \n\nI’m asthmatic",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-23",
    "reviewer_name": null,
    "star_rating": 3.0,
    "review_text": "=== Great weekend - just a very hot room (and it wasn’t a hot day!) ===\nLiked: Great location , beautiful furnished/decorated, friendly staff\nDisliked: Very expensive for what it is. The room was very small and hot.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-02-18",
    "reviewer_name": null,
    "star_rating": 5.0,
    "review_text": "=== beautiful relaxing stay ===\nLiked: the property is beautiful. perfect location\nDisliked: there wasn’t anything not to dislike. it’s stunning.",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-18",
    "reviewer_name": "Alexander",
    "star_rating": 4.5,
    "review_text": "=== Schönes Hotel mit toller Bar ===\nLiked: Bequeme Betten, gepflegte Zimmer\nDisliked: -",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-22",
    "reviewer_name": "Georges",
    "star_rating": 4.5,
    "review_text": "=== Une jolie étape pour un week end dans la new forest ===\nLiked: Qualité et soin de la décoration de l hôtel. Propreté des chambres. Petit déjeuner de qualité.\nDisliked: Parking trop petit obligé de se garer sur le parking adjacent.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-23",
    "reviewer_name": "Wolfgang",
    "star_rating": 2.0,
    "review_text": "=== Schöner Schein mit viel Luft nach oben ===\nLiked: Schöne Ausstattung, geräumige Zimmer, im Hotel Koffertransport auf Nachfrage.\nDisliked: Keine Parkmöglichkeit am Hotel, Koffer selber vom/zum Auto tragen über Treppen und Gehwege.  \r\nViele Stufen über mehrere Etagen ohne Lift, nichts für ältere Leute.\r\nZimmer ohne Klimaanlage, nur ein Gebläse mit zu kurzem Kabel, um dies ins Fenster stellen zu können.\r\nWir hatten 26 Grad im Zimmer bei unserer Ankunft, und nach 2 Stunden lüften erst 25 Grad - unmöglich zu schlafen. \r\n\r\nDie Fenster kann man unten nur 10 cm öffnen im Bad und Rtg. Straße, das dritte Fenster klemmte komplett. Dass man den oberen Teil der Fenster auch herunter schieben kann, erklärte mir der freundliche Nachportier, der mir auch ein Verlängerungskabel für den Ventilator aushändigte. Binnen 30 Minuten war die Temperatur im Zimmer erträglich dank Ventilator im Badfenster (s. Foto). \r\nMorgens war dann natürlich Schluss mit der Nachtruhe da der Verkehr in der Hauptstraße bei offenem Fenster lärmte. \r\n\r\nSitzkissen beim Frühstück waren stark mit Hundehaaren verschmutzt.",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-23",
    "reviewer_name": "Francisco",
    "star_rating": 5.0,
    "review_text": "=== Hotel victoriano, cómodo y céntrico ===\nLiked: Precioso y muy cuidado. Muy buen gusto",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-05-09",
    "reviewer_name": "Catherine",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-05-06",
    "reviewer_name": "Duncan",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-29",
    "reviewer_name": "Jose",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-24",
    "reviewer_name": "Philip",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-21",
    "reviewer_name": "Ross",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-18",
    "reviewer_name": "Nicholas",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-17",
    "reviewer_name": "Michael",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-09",
    "reviewer_name": "Duncan",
    "star_rating": 3.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-09",
    "reviewer_name": "Matt",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-08",
    "reviewer_name": "Martin",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-04-02",
    "reviewer_name": "Steven",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-23",
    "reviewer_name": "Peter",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-23",
    "reviewer_name": "Samantha",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-15",
    "reviewer_name": "Jonathon",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-12",
    "reviewer_name": "Coralie",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-03-02",
    "reviewer_name": "Fariba",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-24",
    "reviewer_name": "Jan",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-24",
    "reviewer_name": "Christopher",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-23",
    "reviewer_name": "Mary",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-17",
    "reviewer_name": "Laurence",
    "star_rating": 3.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-12",
    "reviewer_name": "Andrew",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-12",
    "reviewer_name": "Sarah",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-05",
    "reviewer_name": "Rachel",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-03",
    "reviewer_name": "Joe",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-02-02",
    "reviewer_name": "Lisa",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-21",
    "reviewer_name": "Susan",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-06",
    "reviewer_name": "Christiaan",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-05",
    "reviewer_name": "Emma",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2025-01-05",
    "reviewer_name": "Kim",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-29",
    "reviewer_name": "Louise",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-27",
    "reviewer_name": "Nicola",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-27",
    "reviewer_name": "Saunders",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-23",
    "reviewer_name": "David",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-23",
    "reviewer_name": "Mark",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-23",
    "reviewer_name": "Tom",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-20",
    "reviewer_name": "Smith",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-16",
    "reviewer_name": "Carol",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-15",
    "reviewer_name": "Stuart",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-09",
    "reviewer_name": "Luisa",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-08",
    "reviewer_name": "John",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-07",
    "reviewer_name": "Susan",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-03",
    "reviewer_name": "Alex",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-12-02",
    "reviewer_name": "Philip",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-24",
    "reviewer_name": "Andreas",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-15",
    "reviewer_name": "Kevin",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-12",
    "reviewer_name": "Craig",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-04",
    "reviewer_name": "Ramsay",
    "star_rating": 3.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-04",
    "reviewer_name": "Laure",
    "star_rating": 3.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-04",
    "reviewer_name": "Jonathon",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-03",
    "reviewer_name": "Sue",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-11-02",
    "reviewer_name": "Anne",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-28",
    "reviewer_name": "Gary",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-28",
    "reviewer_name": "Keith",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-27",
    "reviewer_name": "Adam",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-27",
    "reviewer_name": "Matthew",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-27",
    "reviewer_name": "Maggie",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-25",
    "reviewer_name": "Wendy",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-24",
    "reviewer_name": "Tone",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-17",
    "reviewer_name": "Natasha",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-13",
    "reviewer_name": "Maria",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-12",
    "reviewer_name": "John",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-06",
    "reviewer_name": "Giovanna",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-05",
    "reviewer_name": "Phil",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-10-04",
    "reviewer_name": "Graham",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-30",
    "reviewer_name": "Brian",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-28",
    "reviewer_name": "Gerald",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-10",
    "reviewer_name": "Leah",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-09",
    "reviewer_name": "Nathan",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-06",
    "reviewer_name": "Martin",
    "star_rating": 3.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-09-02",
    "reviewer_name": "Ben",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-24",
    "reviewer_name": "Philippa",
    "star_rating": 5.0,
    "review_text": "=== Beautifully decorated. Read some mixed reviews about the restaurant but we had a lovely lunch there. ===",
    "replied": true
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-24",
    "reviewer_name": "Irek",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-09",
    "reviewer_name": "Rob",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-08-09",
    "reviewer_name": "Steven",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-29",
    "reviewer_name": "Jonathancrick",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-17",
    "reviewer_name": "Richard",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-06",
    "reviewer_name": "Stephen",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-07-02",
    "reviewer_name": "Alison",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-30",
    "reviewer_name": "Stacey",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-21",
    "reviewer_name": "Nicola",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-20",
    "reviewer_name": "Derek",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-13",
    "reviewer_name": "Alex",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-12",
    "reviewer_name": "Mark",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-06-10",
    "reviewer_name": "Lewis",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-30",
    "reviewer_name": "Anne-marie",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-30",
    "reviewer_name": "Lucian",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-26",
    "reviewer_name": "Ian",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-23",
    "reviewer_name": "Colin",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-05-15",
    "reviewer_name": "Claire",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-30",
    "reviewer_name": "Hannah",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-21",
    "reviewer_name": "John",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-14",
    "reviewer_name": "Chris",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-10",
    "reviewer_name": "Helen",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-09",
    "reviewer_name": "John",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-07",
    "reviewer_name": "Graham",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-05",
    "reviewer_name": "Stephanie",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-04",
    "reviewer_name": "Richard",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-03",
    "reviewer_name": "Rachel",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-27",
    "reviewer_name": "John",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-21",
    "reviewer_name": "James",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-21",
    "reviewer_name": "Lauren",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-03-03",
    "reviewer_name": "Victoria",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-29",
    "reviewer_name": "Steve",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-19",
    "reviewer_name": "Rebecca",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-18",
    "reviewer_name": "Karen",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-17",
    "reviewer_name": "Victoria",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-02-16",
    "reviewer_name": "Paul",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-30",
    "reviewer_name": "Jane",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-29",
    "reviewer_name": "Louise",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-23",
    "reviewer_name": "Graham",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-23",
    "reviewer_name": "Graham",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-22",
    "reviewer_name": "Catherine",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-18",
    "reviewer_name": "Andrew",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-15",
    "reviewer_name": "Faith",
    "star_rating": 5.0,
    "review_text": "=== Just excellent ===",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-12",
    "reviewer_name": "Jean",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-11",
    "reviewer_name": "Alex",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-11",
    "reviewer_name": "Guy",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-03",
    "reviewer_name": "Karen",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-02",
    "reviewer_name": "Jason",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-01-01",
    "reviewer_name": "Jayne",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-30",
    "reviewer_name": "Kate",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-17",
    "reviewer_name": "Sam",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-09",
    "reviewer_name": "Sarah",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-12-08",
    "reviewer_name": "Rachel",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-30",
    "reviewer_name": "Gary",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-28",
    "reviewer_name": "Adam",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-27",
    "reviewer_name": "Jane",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-23",
    "reviewer_name": "David",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-22",
    "reviewer_name": "Clemence",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-20",
    "reviewer_name": "David",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-19",
    "reviewer_name": "Caroline",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-16",
    "reviewer_name": "Michael",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-15",
    "reviewer_name": "Jennifer",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-13",
    "reviewer_name": "Joanna",
    "star_rating": 5.0,
    "review_text": "=== Perfect ===",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-13",
    "reviewer_name": "John",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-12",
    "reviewer_name": "Kathryn",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-12",
    "reviewer_name": "Avery",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-08",
    "reviewer_name": "Anita",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-05",
    "reviewer_name": "Debra",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-04",
    "reviewer_name": "Ashley",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-04",
    "reviewer_name": "Sue",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-04",
    "reviewer_name": "Chris",
    "star_rating": 0.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-03",
    "reviewer_name": "Neils9",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-31",
    "reviewer_name": "Ian",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-28",
    "reviewer_name": "Philippa",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-28",
    "reviewer_name": "Keith",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-24",
    "reviewer_name": "Mayumi",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-19",
    "reviewer_name": "Tony",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-16",
    "reviewer_name": "Andrew",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-15",
    "reviewer_name": "James",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-07",
    "reviewer_name": "John",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-04",
    "reviewer_name": "Philip",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-02",
    "reviewer_name": "Vicky",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-26",
    "reviewer_name": "Stephen",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-19",
    "reviewer_name": "Cathy",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-18",
    "reviewer_name": "Robert",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-09-13",
    "reviewer_name": "Alexander",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-29",
    "reviewer_name": "Grant",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-28",
    "reviewer_name": "Ian",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-26",
    "reviewer_name": "Christopher",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-24",
    "reviewer_name": "Georgey",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-23",
    "reviewer_name": "Alex",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-14",
    "reviewer_name": "Colin",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-11",
    "reviewer_name": "Nikki",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-07",
    "reviewer_name": "Sam",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-08-01",
    "reviewer_name": "Annie",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-27",
    "reviewer_name": "Chris",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-20",
    "reviewer_name": "Malcolm",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-06",
    "reviewer_name": "Mark",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-02",
    "reviewer_name": "Jon",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-07-02",
    "reviewer_name": "Luke",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-25",
    "reviewer_name": "Peter",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-25",
    "reviewer_name": "Martin",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-21",
    "reviewer_name": "William",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-06-11",
    "reviewer_name": "Robert",
    "star_rating": 1.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-05-30",
    "reviewer_name": "Roderick",
    "star_rating": 3.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-05-19",
    "reviewer_name": "Rob",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-05-05",
    "reviewer_name": "William",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-04-20",
    "reviewer_name": "Fiona",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-04-12",
    "reviewer_name": "Natalie",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-03-30",
    "reviewer_name": "Susan",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-03-27",
    "reviewer_name": "Lucy",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-03-18",
    "reviewer_name": "Jackie",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-03-08",
    "reviewer_name": "Ian",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-03-03",
    "reviewer_name": "Nigel",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-02-26",
    "reviewer_name": "Ray",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-02-19",
    "reviewer_name": "Andrew",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-02-09",
    "reviewer_name": "Benjamin",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-02-05",
    "reviewer_name": "Sarah",
    "star_rating": 4.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-29",
    "reviewer_name": "Sarah",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-28",
    "reviewer_name": "William",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-22",
    "reviewer_name": "Philip",
    "star_rating": 3.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-22",
    "reviewer_name": "Joanna",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-20",
    "reviewer_name": "Miabella",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-15",
    "reviewer_name": "Simon",
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-08",
    "reviewer_name": "Paul",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-01-05",
    "reviewer_name": "Marlon",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-26",
    "reviewer_name": null,
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-11-01",
    "reviewer_name": null,
    "star_rating": 5.0,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2024-04-07",
    "reviewer_name": "Philip",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  },
  {
    "platform": "Booking.com",
    "review_date": "2023-10-23",
    "reviewer_name": "Axel",
    "star_rating": 4.5,
    "review_text": "",
    "replied": false
  }
]